Repository: gentoo-mirror/calculate
Catalog: app-portage/eix/files/*.po
Languages: ru

source: Usage: %s [options] EXPRESSION Search for packages in the index generated by eix-update. EXPRESSION is true or false. Packages for which the EXPRESSION gives true, are included in the final report. EXPRESSION ::= [ --not | -! ] BRACE_OR_TEST | EXPRESSION [ --and | -a ] EXPRESSION | EXPRESSION [ --or | -o ] EXPRESSION | BRACE_OR_TEST ::= --open | -( EXPRESSION --close | -) | TEST_WITH_OPTIONS TEST_WITH_OPTIONS ::= TEST_OPTIONS [PATTERN] Global: Exclusive options: -h, --help show this screen and exit -V, --version show version and exit --dump dump variables to stdout --dump-defaults dump default values of variables --print print the expanded value of a variable --print-all-useflags print all IUSE words used in some version --print-all-keywords print all KEYWORDS used in some version --print-all-slots print all SLOT strings used in some version --print-all-provides print all PROVIDE strings used in some package --print-all-licenses print all LICENSE strings used in some package --print-world-sets print the world sets --print-overlay-path print the path of specified overlay --print-overlay-label print label of specified overlay --is-current check for valid cache-file Special: -t --test-non-matching Before other output, print non-matching entries of /etc/portage/package.* and non-matching names of installed packages; this option is best combined with -T to clean up /etc/portage/package.* -Q, --quick (toggle) don't read unguessable slots of installed packages --care always read slots of installed packages --cache-file use another cache-file instead of %s Output: -q, --quiet (toggle) no output. Typically combined with -0 -n, --nocolor do not use ANSI color codes -F, --force-color force colorful output -*, --pure-packages Omit printing of overlay names and package number --only-names -* with format <category>/<name> -0 --brief (toggle) Print at most one package then stop. See -q Usually faster with COUNT_ONLY_PRINTED=false --brief2 (toggle) Print at most two packages then stop --xml (toggle) output results in XML format -c, --compact (toggle) compact search results -v, --verbose (toggle) verbose search results -x, --versionsort (toggle) sort output by slots/versions -l, --versionlines (toggle) print available versions line-by-line and print IUSE on a per-version base. --format format string for normal output --format-compact format string for compact output --format-verbose format string for verbose output TEST_OPTIONS: Miscellaneous: -I, --installed Next expression only matches installed packages. -i, --multi-installed Match packages installed in several versions. -d, --dup-packages Match duplicated packages. -D, --dup-versions Match packages with duplicated versions. -1, --slotted Match packages with a nontrivial slot. -2, --slots Match packages with two different slots. -u, --upgrade[+-] Match packages without best slotted version. +: settings from LOCAL_PORTAGE_CONFIG=true -: settings from LOCAL_PORTAGE_CONFIG=false --stable[+-] Match packages with a stable version --testing[+-] Match packages with a testing or stable version. --non-masked[+-] Match packages with a non-masked version. --system[+-] Match @system packages. --installed-unstable Match packages with a non-stable installed version. --installed-testing Match packages with a testing installed version. --installed-masked Match packages with a masked installed version. --world-file Match packages of world file or @system. --world-set Match packages of a world set or @system. --world Match packages of @world (file, set or @system). --selected-file Match packages of world file. --selected-set Match packages of a world set. --selected Match packages of @selected (world file or set). --binary Match packages with *.tbz2 files. -O, --overlay Match packages from overlays. --in-overlay OVERLAY Match packages from OVERLAY. --only-in-overlay OVERLAY Match packages only in OVERLAY. -J, --installed-overlay Match packages installed from overlays. --installed-from-overlay OVERLAY Packages installed from OVERLAY. --installed-in-some-overlay Packages with an installed version provided by some overlay. --installed-in-overlay OVERLAY Packages with an installed version provided from OVERLAY. --restrict-fetch Match packages with RESTRICT=fetch. --restrict-mirror Match packages with RESTRICT=mirror. --restrict-primaryuri Match packages with RESTRICT=primaryuri. --restrict-binchecks Match packages with RESTRICT=binchecks. --restrict-strip Match packages with RESTRICT=strip. --restrict-test Match packages with RESTRICT=test. --restrict-userpriv Match packages with RESTRICT=userpriv. --restrict-installsources Match packages with RESTRICT=installsources. --restrict-bindist Match packages with RESTRICT=bindist. --restrict-parallel Match packages with RESTRICT=parallel. --properties-interactive Match packages with PROPERTIES=interactive. --properties-live Match packages with PROPERTIES=live. --properties-virtual Match packages with PROPERTIES=virtual. --properties-set Match packages with PROPERTIES=set. -T, --test-obsolete Match packages with obsolete entries in /etc/portage/package.* (see man eix). Use -t to check non-existing packages. -|, --pipe Use input from pipe of emerge -pv Search Fields: -S, --description description -A, --category-name "category/name" -C, --category category -s, --name name (default) -H, --homepage homepage -L, --license license -P, --provide provides --set local package set name --slot slot --installed-slot slot of installed version -U, --use useflag (of the ebuild) --installed-with-use enabled useflag (of installed package) --installed-without-use disabled useflag (of installed package) Type of Pattern: -r, --regex Pattern is a regexp (default) -e, --exact Pattern is the exact string -z, --substring Pattern is a substring -b, --begin Pattern is the beginning of the string --end Pattern is the end of the string -p, --pattern Pattern is a wildcards-pattern -f [m], --fuzzy [m] Use fuzzy-search with a max. levenshtein-distance m. This program is covered by the GNU General Public License. See COPYING for further information.
ru: Синтаксис: %s [опции] ВЫРАЖЕНИЕ Поиск пакетов по индексу, сгенерированному eix-update. ВЫРАЖЕНИЕ может быть истинным ("true") или ложным ("false"). Пакеты, для которых ВЫРАЖЕНИЕ выдает true, вносятся в итоговый отчет. ВЫРАЖЕНИЕ ::= [ --not | -! ] BRACE_OR_TEST | ВЫРАЖЕНИЕ [ --and | -a ] ВЫРАЖЕНИЕ | ВЫРАЖЕНИЕ [ --or | -o ] ВЫРАЖЕНИЕ | BRACE_OR_TEST ::= --open | -( ВЫРАЖЕНИЕ --close | -) | TEST_WITH_OPTIONS TEST_WITH_OPTIONS ::= TEST_OPTIONS [ШАБЛОН] Общие параметры: Особые опции: -h, --help вывести эту справку и выйти -V, --version показать версию и выйти --dump показать переменные в стандартном выводе --dump-defaults показать значения переменных по умолчанию --print вывести расширенное значение переменной --print-all-useflags вывести все IUSE слова, используемые в некоторых версиях --print-all-keywords вывести все KEYWORDS, используемые в некоторых версиях --print-all-slots вывести все строки SLOT, используемые в некоторых версиях --print-all-provides вывести все строки PROVIDE, используемые в некоторых пакетах --print-all-licenses вывести все строки LICENSE, используемые в некоторых пакетах --print-world-sets вывести сеты world --print-overlay-path вывести путь к указанному оверлею --print-overlay-label вывести метку указанного оверлея --is-current проверить, имеется ли рабочий кэш-файл Специальные: -t --test-non-matching Перед другим выводом показать несовпадающие записи /etc/portage/package.* и те имена установленных пакетов, которые не имеют соответствий; эту опцию предпочтительно использовать вместе с -T для очистки /etc/portage/package.* -Q, --quick (toggle) не прочитывать слоты установленных пакетов, которыене могут быть предположены --care всегда прочитывать слоты установленных пакетов --cache-file использовать другой кэш-файл вместо %s Вывод: -q, --quiet (toggle) без вывода. Обычно используется вместе с -0 -n, --nocolor не использовать цветовые коды ANSI -F, --force-color принудительно использовать цветной вывод -*, --pure-packages не выводить имена оверлеев и число найденных пакетов --only-names -* в формате <категория>/<имя> -0 --brief (toggle) вывести не более одного пакета и остановиться. См. -q Как правило, работает быстрее с выставленным COUNT_ONLY_PRINTED=false --brief2 (toggle) вывести не более двух пакетов и остановиться --xml (toggle) вывод в формате XML -c, --compact (toggle) компактный вывод результатов поиска -v, --verbose (toggle) подробный вывод результатов поиска -x, --versionsort (toggle) сортировать вывод по слотам/версиям -l, --versionlines (toggle) вывести доступные версии построчно и показать данные IUSE для каждой версии --format стандартный формат результатов --format-compact компактный формат результатов --format-verbose подробный формат результатов TEST_OPTIONS: Разное: -I, --installed Применять следующее выражение только к установленным пакетам. -i, --multi-installed Искать пакеты с несколькими установленными версиями. -d, --dup-packages Искать дублированные пакеты. -D, --dup-versions Искать пакеты с дублированными версиями. -1, --slotted Искать пакеты с нетривиальным слотом. -2, --slots Искать пакеты с двумя различными слотами. -u, --upgrade[+-] Искать пакеты, не имеющие слота лучшей версии. +: настройки из LOCAL_PORTAGE_CONFIG=true -: настройки из LOCAL_PORTAGE_CONFIG=false --stable[+-] Искать пакеты со стабильной версией. --testing[+-] Искать пакеты с тестируемой или стабильной версией. --non-masked[+-] Искать пакеты с незамаскированной версией. --system[+-] Искать пакеты сета @system. --installed-unstable Искать пакеты с установленной нестабильной версией. --installed-testing Искать пакеты с установленной тестируемой версией. --installed-masked Искать пакеты с установленной замаскированной версией. --world-file Искать пакеты из world-файла или @system. --world-set Искать пакеты из world-сета или @system. --world Искать пакеты из @world (в файле, сете или @system). --selected-file Искать пакеты из world-файла. --selected-set Искать пакеты из world-сета. --selected Искать пакеты из @selected (в world-файле или сете). --binary Искать пакеты, содержащие *.tbz2-архивы. -O, --overlay Искать пакеты из оверлеев. --in-overlay ОВЕРЛЕЙ Искать пакеты из ОВЕРЛЕя. --only-in-overlay ОВЕРЛЕЙ Искать только пакеты из ОВЕРЛЕя. -J, --installed-overlay Искать пакеты, установленные из оверлеев. --installed-from-overlay ОВЕРЛЕЙ Пакеты, установленные из ОВЕРЛЕя. --installed-in-some-overlay Пакеты, имеющие установленную версию из определенного оверлея. --installed-in-overlay ОВЕРЛЕЙ Пакеты, имеющие установленную версию из ОВЕРЛЕя. --restrict-fetch Искать пакеты с RESTRICT=fetch. --restrict-mirror Искать пакеты с RESTRICT=mirror. --restrict-primaryuri Искать пакеты с RESTRICT=primaryuri. --restrict-binchecks Искать пакеты с RESTRICT=binchecks. --restrict-strip Искать пакеты с RESTRICT=strip. --restrict-test Искать пакеты с RESTRICT=test. --restrict-userpriv Искать пакеты с RESTRICT=userpriv. --restrict-installsources Искать пакеты с RESTRICT=installsources. --restrict-bindist Искать пакеты с RESTRICT=bindist. --restrict-parallel Искать пакеты с RESTRICT=parallel. --properties-interactive Искать пакеты с PROPERTIES=interactive. --properties-live Искать пакеты с PROPERTIES=live. --properties-virtual Искать пакеты с PROPERTIES=virtual. --properties-set Искать пакеты с PROPERTIES=set. -T, --test-obsolete Искать пакеты с устаревшими записями в /etc/portage/package.* (см. "man eix"). Используйте -t для обнаружения несуществующих пакетов. -|, --pipe Использовать ввод, перенаправленный с emerge -pv Шаблон соответствия: -S, --description описание -A, --category-name "категория/имя" -C, --category категория -s, --name имя (по умолчанию) -H, --homepage домашняя страница -L, --license лицензия -P, --provide источник данных --set имя сета локального пакета --slot слот --installed-slot слот установленной версии -U, --use USE-флаг (ебилда) --installed-with-use USE-флаг (с которым собран пакет) --installed-without-use USE-флаг (без которого собран пакет) Алгоритм соответствия: -r, --regex Шаблон - регулярное выражение (по умолчанию) -e, --exact Шаблон - точная строка -z, --substring Шаблон встречается в любом месте строки -b, --begin Шаблон встречается в начале строки --end Шаблон встречается в конце строки -p, --pattern Подстановочный шаблон -f [m], --fuzzy [m] Нечеткий поиск с максимальным levenshtein-расстоянием m. Данная программа распространяется по лицензии GNU General Public License. Более подробную информацию см. в COPYING.

source: Problems while parsing %s: %s
ru: Проблемы при парсинге %s: %s

source: cannot redirect to %r
ru: невозможно перенаправить на %r

source: Can't open the database file %s for reading (mode = 'rb') Did you forget to create it with 'eix-update'?
ru: Не удается открыть файл базы данных %s для чтения (mode = 'rb') Возможно, вы забыли создать его с помощью eix-update.

source: %s was created with an incompatible eix-update: It uses database format %s (current is %s). Please run 'eix-update' and try again.
ru: %s был создан с помощью несовместимого eix-update: Используется формат базы данных %s (текущий формат %s). Вызовите eix-update, а затем попробуйте еще раз.

source: Found %s matches.
ru: Найдено %s совпадений с шаблоном.

source: No matches found.
ru: Совпадений с шаблоном не найдено.

source: Found %s match.
ru: Найдено %s совпадение с шаблоном.

source: No non-matching or empty entries in %s.
ru: В %s нет несовпадающих с шаблоном или пустых записей.

source: No non-matching entries in %s.
ru: В %s нет несовпадающих с шаблоном записей.

source: Non-matching or empty entries in %s:
ru: Несовпадающие с шаблоном или пустые записи в %s:

source: Non-matching entries in %s:
ru: Несовпадающие с шаблоном записи в %s:

source: The names of all installed packages are in the database.
ru: Имена всех установленных пакетов содержатся в базе данных.

source: The following installed packages are not in the database:
ru: Следующие установленные пакеты отсутствуют в базе данных:

source: Usage: %s [options] old-cache [new-cache] -Q, --quick (toggle) do (not) read unguessable slots of installed packages --care always read slots of installed packages -q, --quiet (toggle) (no) output -n, --nocolor don't use colors in output -F, --force-color force colors on things that are not a terminal --dump dump variables to stdout --dump-defaults dump default values of variables --print print the expanded value of a variable -h, --help show a short help screen -V, --version show version-string This program is covered by the GNU General Public License. See COPYING for further information.
ru: Синтаксис: %s [опции] старый_кэш [новый_кэш] -Q, --quick (toggle) (не) прочитывать слоты установленных пакетов, которыеневозможно предположить --care всегда прочитывать слоты установленных пакетов -q, --quiet (toggle) (без) вывода -n, --nocolor без цвета в выводе -F, --force-color принудительно использовать цветной вывод, даже если стандартный вывод не терминал --dump вывести текущие переменные в качестве комментариев --dump-defaults вывести значения переменных по умолчанию в качестве комментариев --print вывести расширенное значение переменной -h, --help вывести короткую справку -V, --version вывести строку, содержащую версию Данная программа распространяется по лицензии GNU General Public License. Более подробную информацию см. в файле COPYING.

source: Can't open the database file %r for reading (mode = 'rb')
ru: Не удается открыть файл базы данных %r для чтения (mode = 'rb')

source: %s was created with an incompatible eix-update: It uses database format %s (current is %s).
ru: %s был создан с помощью несовместимого eix-update: Используется формат базы данных %s (текущий %s).

source: Missing cache-file.
ru: Отсутствует кэш-файл.

source: Diffing databases (%s -> %s packages)
ru: Поиск отличий в базах данных (пакеты %s -> %s)

source: %s must be writable by group portage.
ru: %s должен быть доступен для записи группой portage.

source: You must be in the portage group to update the database. Set SKIP_PERMISSION_TESTS=true to skip this test (e.g. if you use NSS/LDAP).
ru: Для обновления базы данных вы должны быть в группе portage. Чтобы пропустить эту проверку (например, если вы используете NSS/LDAP), установите значение переменной SKIP_PERMISSION_TESTS=true.

source: User 'root' is needed to initially generate the database. Alternatively, you can generate a dummy cachefile %r with write permissions for group portage. Set SKIP_PERMISSION_TESTS=true to skip this test.
ru: Начальная инициализация базы данных разрешена только пользователю root. Вы также можете создать 'кэш-заглушку' %r с правами на запись для группы portage. Чтобы пропустить эту проверку, установите значение переменной SKIP_PERMISSION_TESTS=true.

source: warning: cannot change ownership of cachefile
ru: внимание: невозможно изменить владельца кэш-файла

source: warning: cannot change permissions for cachefile
ru: внимание: невозможно изменить права доступа к кэш-файлу

source: Usage: %s [options] -h, --help show a short help screen -V, --version show version-string --dump show eixrc-variables --dump-defaults show default eixrc-variables --print print the expanded value of a variable -n, --nocolor don't use "colors" (percentage) in output -F, --force-color force "color" on things that are not a terminal -q, --quiet produce no output -o --output output to another file than %s In addition, all permission checks are omitted. -x --exclude-overlay exclude matching overlays from the update-process. Note that you can also exclude PORTDIR using this option. -a --add-overlay add an overlay to the update-process. -m --override-method override cache method for matching overlays. -r --repo-name set label for matching overlay. This program is covered by the GNU General Public License. See COPYING for further information.
ru: Синтаксис: %s [опции] -h, --help вывести краткую справку -V, --version вывести строку, содержащую версию --dump отображать переменные eixrc --dump-defaults отображать переменные eixrc по умолчанию --print вывести расширенное значение переменной -n, --nocolor не использовать цветной вывод (в процентах) -F, --force-color принудительный цветной вывод, даже если стандартный вывод не терминал -q, --quiet без вывода -o --output перенаправлять вывод не в файл %s Кроме того, при выборе этой опции будут пропущены все проверки прав доступа. -x --exclude-overlay исключить найденные оверлеи из update-process. Заметьте, что данная опция позволяет также исключить PORTDIR. -a --add-overlay добавить оверлей к update-process. -m --override-method переопределить метод кэширования для найденных оверлеев. -r --repo-name установить метку для найденного оверлея. Данная программа распространяется по лицензии GNU General Public License. Более подробную информацию см. в файле COPYING.

source: %s must be a list of the form DIRECTORY METHOD
ru: %s должен быть списком формы DIRECTORY METHOD

source: %s must be a list of the form DIR-PATTERN OVERLAY-LABEL
ru: %s должен быть списком формы DIR-PATTERN OVERLAY-LABEL

source: KEEP_VIRTUALS is ignored: there is no previous %s
ru: KEEP_VIRTUALS игнорируется: нет более раннего %s

source: Adding virtual overlays from %s ..
ru: Добавляются виртуальные оверлеи из %s ..

source: Warning: KEEP_VIRTUALS ignored because database format has changed
ru: Внимание: KEEP_VIRTUALS проигнорирован, так как изменился формат базы данных.

source: Reading Portage settings ..
ru: Считываются настройки portage..

source: Excluded PORTDIR: %s
ru: Исключена PORTDIR: %s

source: Excluded overlay %s
ru: Исключен оверлей %s

source: Building database (%s) ..
ru: Генерируется база данных (%s) ..

source: Excluding "%s" %s (cache: %s)
ru: Исключается "%s" %s (кэш: %s)

source: [%s] "%s" %s (cache: %s)
ru: [%s] "%s" %s (кэш: %s)

source: Reading Packages ..
ru: Считываются пакеты ..

source: Finished
ru: Завершено

source: ABORTED!
ru: ПРЕРВАНО!

source: Reading category %s|%s (%s%%)
ru: Считывается категория %s|%s (%s%%)

source: Reading up to %s categories of packages ..
ru: Считываются категории пакетов до %s ..

source: EMPTY!
ru: ПУСТО!

source: Applying masks ..
ru: Применяются маски ..

source: Calculating hash tables ..
ru: Вычисляются хэш-таблицы ..

source: Writing database file %s ..
ru: Записывается файл базы данных %s ..

source: Can't open the database file %r for writing (mode = 'wb')
ru: Не удается открыть файл базы данных %r для записи (mode = 'wb')

source: Database contains %s packages in %s categories.
ru: База данных содержит %s пакетов в %s категориях.

source: cannot determine version of %s
ru: невозможно определить версию %s

source: Unknown cache %r for directory %r
ru: Неизвестный кэш %r для каталога %r

source: Problems with %s.. skipping
ru: Проблемы с %s.. пропускается

source: Cannot split %r into package and version
ru: Не удается разбить %r на пакет и версию

source: Can't read cache file %s:
ru: Не удается прочитать кэш-файл %s:

source: Can't unlink tempfile %s
ru: Не удается удалить ссылку на временный файл %s

source: Tempfile %s still there after unlink
ru: Несмотря на удаление ссылки, временный файл %s не был удален

source: Tempfile %s is not a file
ru: Временный файл %s не является файлом

source: Creation of tempfile failed
ru: Не удалось создать временный файл

source: Forking failed
ru: Ветвление не удалось

source: Got signal %s
ru: Получен сигнал %s

source: Ebuild got signal %s
ru: Ебилд получил сигнал %s

source: Could not start %s
ru: Не удалось запустить %s

source: Ebuild failed with status %s
ru: Ошибка ебилда со статусом %s

source: Child aborted in a strange way
ru: Дочерний процесс неожиданно прерван

source: Can't read cache file %s: %s
ru: Невозможно прочитать кэш-файл %s: %s

source: Can't open %s: %s
ru: Не удается открыть %s: %s

source: wrong cpickle header
ru: ошибка в заголовке cpickle

source: Unsupported pickle value %r
ru: Неподдерживаемое значение pickle %r

source: Cache file %s does not contain overlay %r [%s]
ru: Кэш-файл %s не содержит оверлея %r [%s]

source: Cache file %s does not contain overlay %s
ru: Кэш-файл %s не содержит оверлея %s

source: Cache file %s uses newer format %s (current is %s)
ru: Кэш-файл %s использует более новый формат %s (текущий %s)

source: Cache file %s uses obsolete format %s (current is %s)
ru: Кэш-файл %s использует устаревший формат %s (текущий формат %s)

source: Can't split %r into package and version
ru: Не удается разбить %r на пакет и версию

source: Could not properly parse %s: %s
ru: Не удается корректно провести синтаксический анализ %s: %s

source: Could not properly execute %s
ru: Не удается корректно выполнить %s

source: Can't split filename of ebuild %s/%s
ru: Не удается разбить имя файла ебилда %s/%s

source: %r not of the form package/catstring-version
ru: %r не соответствует шаблону пакет/catstring-версия

source: Can't read cache file %s
ru: Не удается прочитать кэш-файл %s

source: Problems with %s: %s
ru: Проблемы с %s: %s

source: sqlite dataset does not contain a package name
ru: набор данных sqlite не содержит имени пакета

source: sqlite dataset for %s is too small
ru: набор данных sqlite для %s слишком мал

source: %r not of the form package/category-version
ru: %r не соответствует шаблону пакет/категория-версия

source: Database path incorrect
ru: Неверный путь к базе данных

source: Can't open cache file %s
ru: Не удается открыть кэш-файл %s

source: sqlite error: %s
ru: Ошибка sqlite: %s

source: Cache method sqlite is not compiled in. Recompile eix, using configure option --with-sqlite to add sqlite support
ru: Кэширование для sqlite не поддерживается. Пересоберите eix с использованием конфигурационной опции --with-sqlite для добавления поддержки sqlite

source: error while reading from database: end of file
ru: ошибка при считывании базы данных: конец файла
