Repository: gentoo-mirror/calculate
Catalog: app-portage/eix/files/*.po
Languages: ru

source: Color for versions with *.tbz2. This is only used for delayed substitution.
ru: Цвет для вывода версий с *.tbz2-архивом. Используется только для отложенной подстановки.

source: Color for the restriction tags. This is only used for delayed substitution.
ru: Цвет ограничительных меток. Используется только для отложенной подстановки.

source: Color for the properties tags. This is only used for delayed substitution.
ru: Цвет меток свойств. Используется только для отложенной подстановки.

source: This variable is only used for delayed substitution. It defines how installed versions are marked.
ru: Эта переменная используется только для отложенной подстановки. Она определяет способ обозначения установленных версий.

source: This variable is only used for delayed substitution. It defines how upgrade candidate versions are marked.
ru: Эта переменная используется только для отложенной подстановки. Она определяет способ обозначения версий, предлагаемых для обновления.

source: This variable is only used for delayed substitution. It defines how the package versions passed with --pipe are marked.
ru: Эта переменная используется только для отложенной подстановки. Она определяет способ обозначения версий пакетов, к которым применяется ключ --pipe.

source: This turns --force-color on for every query.
ru: Включать опцию --force-color при каждом поиске.

source: Show the percentage progress even in case of redirection.
ru: Показывать ход выполнения в процентах даже в случае перенаправления.

source: This variable is only used for delayed substitution. If false, versions are only colored according to the local setting.
ru: Эта переменная используется только для отложенной подстановки. Если ее значение false, цвет вывода версий определяется только локальными настройками.

source: This variable is only used for delayed substitution. If false, COLOR_ORIGINAL=false has no effect on versions which are only locally masked (i.e. [m]).
ru: Эта переменная используется только для отложенной подстановки. Если ее значение false, COLOR_ORIGINAL=false не будет влиять на версии, которые замаскированы только локально (например, с [m]).

source: Defines whether --versionsorted is on by default.
ru: Определяет, выставляется ли опция --versionsorted по умолчанию.

source: Defines whether --versionlines is on by default.
ru: Определяет, выставляется ли опция --versionlines по умолчанию.

source: This variable is only used for delayed substitution. If false, the slotnames appended to versions are not colored.
ru: Эта переменная используется только для отложенной подстановки. Если ее значение false, имена слотов при версиях не выделяются цветом.

source: This variable is only used for delayed substitution. If true, separated slots from versions with a colon instead of braces.
ru: Эта переменная используется только для отложенной подстановки. Если ее значение true, слоты отделяются от версий двоеточием, а не ставятся в фигурные скобки.

source: Whether default concatenation of queries is -o (or) or -a (and)
ru: Определяет, соединяются ли по умолчанию запросы с помощью оператора -o (или) или -a (и)

source: Whether checks for duplicate packages occur only among overlays
ru: Определяет, будет ли проверка на дублированные пакеты произведена среди оверлеев.

source: Whether checks for duplicate versions occur only among overlays
ru: Определяет, будет ли проверка на дублированные версии произведена среди оверлеев.

source: Which overlays to list (all/all-if-used/all-used/all-used-renumbered/no)
ru: Определяет, какие оверлеи выводить (all/all-if-used/all-used/all-used-renumbered/no)

source: The default maximal levensthein distance for which a string is considered a match for the fuzzy match algorithm.
ru: Максимальное levensthein-расстояние по умолчанию, при котором строка считается совпадением при использовании нечеткого алгоритма соответствия.

source: This string is appended to all cache methods using parse[*] or ebuild[*].
ru: Эта строка добавляется ко всем методам кэширования, использующим parse[*] или ebuild[*].

source: Portage cache-backend that should be used for PORTDIR (metadata[:*]/sqlite/cdb/flat[:*]/portage-2.1/parse[*][|]ebuild[*]/eix[*][:*])
ru: Кэш-бэкенд portage, который должен использоваться для PORTDIR (metadata[:*]/sqlite/cdb/flat[:*]/portage-2.1/parse[*][|]ebuild[*]/eix[*][:*])

source: Portage cache-backend that should be used for the overlays. (metadata[:*]/sqlite/cdb/flat[:*]/portage-2.1/parse[*][|]ebuild[*]/eix[*][:*])
ru: Кэш-бэкенд portage, который должен использоваться для оверлеев. (metadata[:*]/sqlite/cdb/flat[:*]/portage-2.1/parse[*][|]ebuild[*]/eix[*][:*])

source: This variable is only used for delayed substitution in CACHE_METHOD. It is meant to be a local addition to CACHE_METHOD.
ru: Эта переменная используется только для отложенной подстановки в CACHE_METHOD. Она должна быть локальным добавлением к CACHE_METHOD.

source: Overrides OVERLAY_CACHE_METHOD or PORTDIR_CACHE_METHOD for particular paths. This is a list of pairs DIR-PATTERN METHOD. Later entries take precedence.
ru: Переопределяет OVERLAY_CACHE_METHOD или PORTDIR_CACHE_METHOD для определенных путей. Это список пар DIR-PATTERN METHOD. Предпочтение будет отдаваться более поздним записям.

source: This variable is only used for delayed substitution in OVERRIDE_CACHE_METHOD. It is meant to be a local addition to OVERRIDE_CACHE_METHOD.
ru: Эта переменная используется только для отложенной подстановки в OVERRIDE_CACHE_METHOD. Она должна быть локальным дополнением к OVERRIDE_CACHE_METHOD.

source: This variable can override the choices of CACHE_METHOD, and in addition it can override the choices made by KEEP_VIRTUALS.
ru: Эта переменная может переопределять выбор CACHE_METHOD, а также, дополнительно, значения, определенные KEEP_VIRTUALS.

source: This is a list of pairs DIR-PATTERN OVERLAY_LABEL. When a new cachefile is created, the overlay matching DIR-PATTERN obtains the label OVERLAY_LABEL, independent of the content of profiles/repo_name or the label associated by KEEP_VIRTUALS. The last matching DIR_PATTERN takes precedence.
ru: Это список пар DIR-PATTERN OVERLAY_LABEL. Когда создается новый кэш-файл, оверлей, совпадающий с шаблоном DIR-PATTERN, получает метку OVERLAY_LABEL, независимо от содержания profiles/repo_name или метки, предложенной KEEP_VIRTUALS. Предпочтение будет отдано более позднему совпадению DIR_PATTERN.

source: List of overlays that should be excluded from the index.
ru: Список оверлеев, которые должны быть исключены из перечня.

source: List of overlays that should be added to the index.
ru: Список оверлеев, которые должны быть добавлены к перечню.

source: If true and overlays are excluded or added, export modified PORTDIR_OVERLAY.
ru: Если значение true и были исключены или добавлены оверлеи, экспортировать измененную PORTDIR_OVERLAY.

source: Keep virtuals of the old cache file by adding corresponding entries implicitly to the values of ADD_OVERLAY and ADD_CACHE_METHOD
ru: Сохранять виртуальные значения более раннего кэша путем добавления соответствующих записей по умолчанию к значениям ADD_OVERLAY и ADD_CACHE_METHOD

source: If false, /etc/portage and ACCEPT_KEYWORDS are ignored.
ru: Если значение false, /etc/portage и ACCEPT_KEYWORDS будут игнорироваться.

source: If true, ACCEPT_KEYWORDS is used even without LOCAL_PORTAGE_CONFIG, e.g. to determine the "default" stability.
ru: Если значение true, ACCEPT_KEYWORDS будет использовано даже без LOCAL_PORTAGE_CONFIG, например, для определения стабильности по умолчанию.

source: If +/-, eix -u will match as if LOCAL_PORTAGE_CONFIG=true/false.
ru: При +/- eix -u будет искать соответствия, как при LOCAL_PORTAGE_CONFIG=true/false.

source: If +/-, recommendations for up- or downgrade will act as if LOCAL_PORTAGE_CONFIG=true/false.
ru: При +/- рекомендации по обновлению или откату будут аналогичны ситуации, когда LOCAL_PORTAGE_CONFIG=true/false.

source: Are packages/sets in included sets part of the parent set?
ru: Находятся ли пакеты/сеты в разделе включенных сетов родительского сета?

source: If true, upgrade tests succeed for installed packages with new higher slots. Use the files SLOT_UPGRADE_FORBID or SLOT_UPGRADE_ALLOW, respectively, to specify exceptions.
ru: Если значение true, проверки обновлений будут успешными для установленных пакетов с новыми более высокими слотами. Используйте файлы SLOT_UPGRADE_FORBID или SLOT_UPGRADE_ALLOW, соответственно, чтобы указать исключения.

source: This variable is only used for delayed substitution. If false, no slot information is printed.
ru: Эта переменная используется только для отложенной подстановки. Если значение false, информация о слотах выводиться не будет.

source: This variable is only used for delayed substitution. If false, no IUSE data is printed for eix.
ru: Эта переменная используется только для отложенной подстановки. Если значение false, будут выведены IUSE-данные для eix.

source: This variable is only used for delayed substitution. If false, no IUSE data is printed for eix-diff.
ru: Эта переменная используется только для отложенной подстановки. Если значение false, IUSE-данные для eix-diff выводиться не будут.

source: This variable is only used for delayed substitution. If false, no IUSE data is printed.
ru: Эта переменная используется только для отложенной подстановки. Если значение false, IUSE-данные data выводиться не будут.

source: If false, sort installed useflags by whether they are set.
ru: Если значение false, установленные USE-флаги будут отсортированы в зависимости от того, активны ли они.

source: Allowed values are true/false/repository. If true, always check from which overlay a package version was installed. If false, only packages with versions in at least two trees are checked. The compromise - repository - checks at least always the repository files. Without a check, the assumed overlay may be wrong if the version was actually installed from a place not in the database anymore.
ru: Допустимые значения: true/false/repository. Если значение true, всегда проверять, из какого оверлея устанавливался пакет. Если значение false, проверяться будут только пакеты с версиями, содержащимися как минимум в двух деревьях. Компромиссное значение, repository, позволяет всегда проверять по крайней мере файлы репозиториев. Если не производить проверку, оверлей может быть определен ошибочно, если данная версия была установлена из места, которое уже не фигурирует в базе данных.

source: If true, treat -* in /etc/portage/package.keywords as <=portage-2.1.2 Since >=portage-2.1.2-r4, -* is practically obsolete and replaced by ** which accepts anything (note that there are also * and ~*).
ru: Если значение true, обрабатывать -* в /etc/portage/package.keywords как <=portage-2.1.2 В версиях portage выше 2.1.2-r4, ключ -*, в сущности, устарел и заменяется на **, т.е. принимать все (заметьте, что существуют также обозначения * и ~*).

source: Allowed values are true/false/never. If true, always print the number of matches (even 0 or 1) in the last line.
ru: Допустимые значения: true/false/never. Если значение true, всегда выводить количество соответствий (даже 0 или 1) в последней строке.

source: If false, count independently of whether the matches are printed.
ru: Если значение false, принимать независимое решение о том, выводить ли количество соответствий.

source: Tag for versions with *.tbz2. This is only used for delayed substitution.
ru: Метка для версий с *.tbz2-архивом. Используется только для отложенной подстановки.

source: Tag for RESTRICT=fetch. This is only used for delayed substitution.
ru: Метка для RESTRICT=fetch. Используется только для отложенной подстановки.

source: Tag for RESTRICT=mirror. This is only used for delayed substitution.
ru: Метка для RESTRICT=mirror. Используется только для отложенной подстановки.

source: Tag for RESTRICT=primaryuri. This is only used for delayed substitution.
ru: Метка для RESTRICT=primaryuri. Используется только для отложенной подстановки.

source: Tag for RESTRICT=binchecks. This is only used for delayed substitution.
ru: Метка для RESTRICT=binchecks. Используется только для отложенной подстановки.

source: Tag for RESTRICT=strip. This is only used for delayed substitution.
ru: Метка для RESTRICT=strip. Используется только для отложенной подстановки.

source: Tag for RESTRICT=test. This is only used for delayed substitution.
ru: Метка для RESTRICT=test. Используется только для отложенной подстановки.

source: Tag for RESTRICT=userpriv. This is only used for delayed substitution.
ru: Метка для RESTRICT=userpriv. Используется только для отложенной подстановки.

source: Tag for RESTRICT=installsources. This is only used for delayed substitution.
ru: Метка для RESTRICT=installsources. Используется только для отложенной подстановки.

source: Tag for RESTRICT=bindist. This is only used for delayed substitution.
ru: Метка для RESTRICT=bindist. Используется только для отложенной подстановки.

source: Tag for RESTRICT=parallel. This is only used for delayed substitution.
ru: Метка для RESTRICT=parallel. Используется только для отложенной подстановки.

source: Tag for PROPERTIES=interactive. This is only used for delayed substitution.
ru: Метка для PROPERTIES=interactive. Используется только для отложенной подстановки.

source: Tag for PROPERTIES=live. This is only used for delayed substitution.
ru: Метка для PROPERTIES=live. Используется только для отложенной подстановки.

source: Tag for PROPERTIES=virtual. This is only used for delayed substitution.
ru: Метка для PROPERTIES=virtual. Используется только для отложенной подстановки.

source: Tag for PROPERTIES=set. This is only used for delayed substitution.
ru: Метка для PROPERTIES=set. Используется только для отложенной подстановки.

source: This variable is only used for delayed substitution. It is the tag for "profile masked" versions.
ru: Эта переменная используется только для отложенной подстановки. Это метка версий "замаскирован профилем".

source: This variable is only used for delayed substitution. It is the tag for "package.masked" versions.
ru: Эта переменная используется только для отложенной подстановки. Это метка версий "замаскирован через package.masked".

source: This variable is only used for delayed substitution. It is the tag for "originally profile masked but unmasked" versions.
ru: Эта переменная используется только для отложенной подстановки. Это метка версий "изначально замаскирован профилем, но на данный момент размаскирован".

source: This variable is only used for delayed substitution. It is the tag for "originally package.masked but unmasked" versions.
ru: Эта переменная используется только для отложенной подстановки. Это метка версий "изначально замаскирован через package.masked, но на данный момент размаскирован".

source: This variable is only used for delayed substitution. It is the tag for "only locally masked" versions.
ru: Эта переменная используется только для отложенной подстановки. Это метка версий "замаскирован только локально".

source: This variable is only used for delayed substitution. It is the tag for "stable" versions.
ru: Эта переменная используется только для отложенной подстановки. Это метка стабильных версий.

source: This variable is only used for delayed substitution. It is the tag for "unstable" versions.
ru: Эта переменная используется только для отложенной подстановки. Это метка нестабильных версий.

source: This variable is only used for delayed substitution. It is the tag for "-*" versions.
ru: Эта переменная используется только для отложенной подстановки. Это метка версий "-*".

source: This variable is only used for delayed substitution. It is the tag for "-~*" versions.
ru: Эта переменная используется только для отложенной подстановки. Это метка версий "-~*".

source: This variable is only used for delayed substitution. It is the tag for "-ARCH" versions.
ru: Эта переменная используется только для отложенной подстановки. Это метка версий "-ARCH".

source: This variable is only used for delayed substitution. It is the tag for "ALIENARCH" versions.
ru: Эта переменная используется только для отложенной подстановки. Это метка версий "ALIENARCH".

source: This variable is only used for delayed substitution. It is the tag for "~ALIENARCH" versions.
ru: Эта переменная используется только для отложенной подстановки. Это метка версий "~ALIENARCH".

source: This variable is only used for delayed substitution. It is the tag for "no keyword" versions.
ru: Эта переменная используется только для отложенной подстановки. Это метка версий "без ключевого слова".

source: This variable is only used for delayed substitution. It is the tag for "originally unstable but now stable" versions.
ru: Эта переменная используется только для отложенной подстановки. Это метка версий "изначально нестабильный, но на данный момент стабильный".

source: This variable is only used for delayed substitution. It is the tag for "originally -* but now stable" versions.
ru: Эта переменная используется только для отложенной подстановки. Это метка версий "изначально -*, но на данный момент стабильный".

source: This variable is only used for delayed substitution. It is the tag for "originally -~* but now stable" versions.
ru: Эта переменная используется только для отложенной подстановки. Это метка версий "изначально -~*, но на данный момент стабильный".

source: This variable is only used for delayed substitution. It is the tag for "originally -ARCH but now stable" versions.
ru: Эта переменная используется только для отложенной подстановки. Это метка версий "изначально -ARCH, но на данный момент стабильный".

source: This variable is only used for delayed substitution. It is the tag for "originally ALIENARCH but now stable" versions.
ru: Эта переменная используется только для отложенной подстановки. Это метка версий "изначально ALIENARCH, но на данный момент стабильный".

source: This variable is only used for delayed substitution. It is the tag for "originally ~ALIENARCH but now stable" versions.
ru: Эта переменная используется только для отложенной подстановки. Это метка версий "изначально ~ALIENARCH, но на данный момент стабильный".

source: This variable is only used for delayed substitution. It is the tag for "originally no keyword but now stable" versions.
ru: Эта переменная используется только для отложенной подстановки. Это метка версий "изначально без ключевого слова, но на данный момент стабильный".

source: This variable is only used for delayed substitution. It is a regular expression used in DEFAULT_MATCH_FIELD for description.
ru: Эта переменная используется только для отложенной подстановки. Это регулярное выражение, используемое в DEFAULT_MATCH_FIELD для description.

source: This variable is only used for delayed substitution. It is a regular expression used in DEFAULT_MATCH_FIELD for set.
ru: Эта переменная используется только для отложенной подстановки. Это регулярное выражение, используемое в DEFAULT_MATCH_FIELD для set.

source: This variable is only used for delayed substitution. It is a regular expression used in DEFAULT_MATCH_FIELD for homepage.
ru: Эта переменная используется только для отложенной подстановки. Это регулярное выражение, используемое в DEFAULT_MATCH_FIELD для homepage.

source: This variable is only used for delayed substitution. It is a regular expression used in DEFAULT_MATCH_FIELD for virtuals, that is for provide or category/name.
ru: Эта переменная используется только для отложенной подстановки. Это регулярное выражение, используемое в DEFAULT_MATCH_FIELD для виртуальных оверлеев, т.е. для provide или category/name.

source: This variable is only used for delayed substitution. It is a regular expression used in DEFAULT_MATCH_FIELD for provide.
ru: Эта переменная используется только для отложенной подстановки. Это регулярное выражение, используемое в DEFAULT_MATCH_FIELD для provide.

source: This variable is only used for delayed substitution. It is a regular expression used in DEFAULT_MATCH_FIELD for category/name.
ru: Эта переменная используется только для отложенной подстановки. Это регулярное выражение, используемое в DEFAULT_MATCH_FIELD для category/name.

source: This variable is only used for delayed substitution. It is a regular expression used in DEFAULT_MATCH_FIELD for license.
ru: Эта переменная используется только для отложенной подстановки. Это регулярное выражение, используемое в DEFAULT_MATCH_FIELD для license.

source: This is a list of strings of the form regexp[ ]match_field. If regexp matches the search pattern, use match_field as the default. A fallback match_field may be specified as the last entry in the list. Admissible values for match_field are: name, category, category/name, description, license, homepage, provide, set, slot, installed-slot, use with-use, without-use.
ru: Это список строк для формы regexp[ ]match_field. Если регулярное выражение соответствует шаблону поиска, по умолчанию используется match_field. Последней записью в списке может быть аварийное match_field. Допустимые значения для match_field: name, category, category/name, description, license, homepage, provide, set, slot, installed-slot, use with-use, without-use.

source: This variable is only used for delayed substitution. It is a regular expression used in DEFAULT_MATCH_ALGORITHM for regex.
ru: Эта переменная используется только для отложенной подстановки. Это регулярное выражение, используемое в DEFAULT_MATCH_ALGORITHM для regex.

source: This variable is only used for delayed substitution. It is a regular expression used in DEFAULT_MATCH_ALGORITHM for pattern.
ru: Эта переменная используется только для отложенной подстановки. Это регулярное выражение, используемое в DEFAULT_MATCH_ALGORITHM для pattern.

source: This variable is only used for delayed substitution. It is a regular expression used in DEFAULT_MATCH_ALGORITHM for substring.
ru: Эта переменная используется только для отложенной подстановки. Это регулярное выражение, используемое в DEFAULT_MATCH_ALGORITHM для substring.

source: This variable is only used for delayed substitution. It is a regular expression used in DEFAULT_MATCH_ALGORITHM for exact.
ru: Эта переменная используется только для отложенной подстановки. Это регулярное выражение, используемое в DEFAULT_MATCH_ALGORITHM для exact.

source: This variable is only used for delayed substitution. It is a regular expression used in DEFAULT_MATCH_ALGORITHM for begin.
ru: Эта переменная используется только для отложенной подстановки. Это регулярное выражение, используемое в DEFAULT_MATCH_ALGORITHM для begin.

source: This is a list of strings of the form regexp[ ]match_algorithm. If regexp matches the search pattern, use match_algorithm as the default. A fallback match_algorithm may be specified as the last entry in the list. Admissible values for match_algorithm are: regex, pattern, substring, begin, end, exact, fuzzy.
ru: Это список строк формы regexp[ ]match_algorithm. Если регулярное выражение совпадает с шаблоном поиска, по умолчанию используется match_algorithm. Последней записью в списке может быть аварийное match_algorithm. Допустимые значения для переменной match_algorithm: regex, pattern, substring, begin, end, exact, fuzzy.

source: Defines whether empty entries in /etc/portage/package.* are shown with -t.
ru: Определяет, отображать ли пустые записи в /etc/portage/package.* при выборе опции -t.

source: Defines whether /etc/portage/package.accept_keywords is tested with -t.
ru: Определяет, подвергать ли проверке /etc/portage/package.accept_keywords при выборе опции -t.

source: Defines whether /etc/portage/package.mask is tested with -t.
ru: Определяет, подвергать ли проверке /etc/portage/package.mask при выборе опции -t.

source: Defines whether /etc/portage/package.unmask is tested with -t.
ru: Определяет, подвергать ли проверке /etc/portage/package.unmask при выборе опции -t.
