Repository: gentoo-mirror/calculate
Catalog: app-portage/eix/files/*.po
Languages: ru

source: Defines whether /etc/portage/package.use is tested with -t.
ru: Определяет, подвергать ли проверке /etc/portage/package.use при выборе опции -t.

source: Defines whether /etc/portage/package.env is tested with -t.
ru: Определяет, подвергать ли проверке /etc/portage/package.env при выборе опции -t.

source: Defines whether /etc/portage/package.license is tested with -t.
ru: Определяет, подвергать ли проверке /etc/portage/package.license при выборе опции -t.

source: Defines whether /etc/portage/package.cflags is tested with -t.
ru: Определяет, подвергать ли проверке /etc/portage/package.cflags при выборе опции -t.

source: Defines whether removed packages are tested with -t.
ru: Определяет, подвергать ли проверке удаленные пакеты при выборе опции -t.

source: Defines whether non-existing installed versions are positive for -T.
ru: Определяет для -T, имеются ли несуществующие установленные версии.

source: Defines whether versions are non-existent for TEST_FOR_NONEXISTENT if they come from a different overlay than the installed version.
ru: Определяет для TEST_FOR_NONEXISTENT, являются ли версии несуществующими, если они из другого оверлея, нежели установленная версия.

source: Defines whether masked versions are non-existent for TEST_FOR_NONEXISTENT.
ru: Определяет для TEST_FOR_NONEXISTENT, являются ли замаскированные версии несуществующими.

source: Defines whether redundant entries are positive for -T.
ru: Определяет для -T, имеются ли повторяющиеся записи.

source: If full or true modify ARCH by ACCEPT_KEYWORDS. This determines which keywords are considered as ARCH or OTHERARCH. The value full also influences the original ARCH keywording.
ru: Если установлено значение full или true, ARCH изменяется с помощью ACCEPT_KEYWORDS. Эта переменная определяет, какие ключевые слова рассматривать как ARCH или OTHERARCH. Значение full влияет также на исходное определение ARCH.

source: Applies if /etc/portage/package.accept_keywords lists the same keyword twice for the versions in question.
ru: Применяется, если в /etc/portage/package.accept_keywords одно и то же ключевое слово использовано дважды для данных версий.

source: Applies if /etc/portage/package.accept_keywords has two lines for identical target.
ru: Применяется, если в /etc/portage/package.accept_keywords имеется две строки для одного адресата.

source: Applies if /etc/portage/package.accept_keywords lists two different keywords, e.g. ~ARCH and -*, for the versions in question.
ru: Применяется, если /etc/portage/package.accept_keywords содержит два различных ключевых слова дла данных версий, например, ~ARCH и -*.

source: Applies if /etc/portage/package.accept_keywords lists a keywords which can be replaced by a weaker keyword, e.g. -* or ~OTHERARCH or OTHERARCH in place of ~ARCH, or ~OTHERARCH in place of OTHERARCH, for the versions in question.
ru: Применяется, если /etc/portage/package.accept_keywords содержит ключевое слово, которое может быть заменено более слабым, например, -*, ~OTHERARCH или OTHERARCH вместо ~ARCH, или ~OTHERARCH вместо OTHERARCH, с данными версиями.

source: Applies if /etc/portage/package.accept_keywords lists a strange keyword e.g. UNKNOWNARCH (unknown to the .ebuild and ARCH) or -OTHERARCH, for the versions in question.
ru: Применяется, если /etc/portage/package.accept_keywords содержит ключевое слово, указывающее на стороннюю архитектуру, например, UNKNOWNARCH (неизвестно .ebuild и ARCH) или -OTHERARCH, данных версий.

source: Applies if /etc/portage/package.accept_keywords contains some -* entry. This test only applies if OBSOLETE_MINUSASTERISK is false.
ru: Применяется, если /etc/portage/package.accept_keywords содержит несколько записей -*. Эта проверка производится только в том случае, если переменная OBSOLETE_MINUSASTERISK установлена на false.

source: Applies if /etc/portage/package.accept_keywords provides keywords which do not change the availability keywords status for the versions in question.
ru: Применяется, если /etc/portage/package.accept_keywords содержит ключевые слова, которые не меняют ключевые слова доступности для данных версий.

source: Applies if /etc/portage/package.mask contains entries which do not change the mask status for the versions in question.
ru: Применяется, если в /etc/portage/package.mask содержатся записи, которые не меняют статус маски для данных версий.

source: Applies if /etc/portage/package.unmask contains entries which do not change the mask status for the versions in question.
ru: Применяется, если в /etc/portage/package.unmask содержатся записи, которые не меняют статус маски для данных версий.

source: Applies if /etc/portage/package.mask matches twice for the versions in question.
ru: Применяется, если в /etc/portage/package.mask содержится два совпадения с данными версиями.

source: Applies if /etc/portage/package.unmask matches twice for the versions in question.
ru: Применяется, если в /etc/portage/package.unmask содержится два совпадения с данными версиями.

source: Applies if /etc/portage/package.use matches twice for the versions in question.
ru: Применяется, если в /etc/portage/package.use содержится два совпадения с данными версиями.

source: Applies if /etc/portage/package.env matches twice for the versions in question.
ru: Применяется, если в /etc/portage/package.env содержится два совпадения с данными версиями.

source: Applies if /etc/portage/package.license matches twice for the versions in question.
ru: Применяется, если в /etc/portage/package.license содержится два совпадения с данными версиями.

source: Applies if /etc/portage/package.cflags matches twice for the versions in question.
ru: Применяется, если в /etc/portage/package.cflags содержится два совпадения с данными версиями.

source: Applies if /etc/portage/package.accept_keywords contains a matching entry.
ru: Применяется, если /etc/portage/package.accept_keywords содержит запись, совпадающую с шаблоном.

source: Applies if /etc/portage/package.mask matches.
ru: Применяется при условии совпадения в /etc/portage/package.mask.

source: Applies if /etc/portage/package.unmask matches.
ru: Применяется при условии совпадения в /etc/portage/package.unmask.

source: Applies if /etc/portage/package.use matches.
ru: Применяется при условии совпадения в /etc/portage/package.use.

source: Applies if /etc/portage/package.env matches.
ru: Применяется при условии совпадения в /etc/portage/package.env.

source: Applies if /etc/portage/package.license matches.
ru: Применяется при условии совпадения в /etc/portage/package.license.

source: Applies if /etc/portage/package.cflags matches.
ru: Применяется при условии совпадения в /etc/portage/package.cflags.

source: This variable is only used for delayed substitution. It is the directory where eix searches for its package.*.*/sets.eix files.
ru: Эта переменная используется только для отложенной подстановки. Это каталог, в котором eix ищет файлы package.*.*/sets.eix.

source: If UPGRADE_TO_HIGHEST_SLOT=true, then packages listed in these files/dirs are treated as if UPGRADE_TO_HIGHEST_SLOT=false.
ru: Если UPGRADE_TO_HIGHEST_SLOT=true,то для пакетов, перечисленных в этих файлах/каталогах, будет принято UPGRADE_TO_HIGHEST_SLOT=false.

source: If UPGRADE_TO_HIGHEST_SLOT=false, then packages listed in these files/dirs are treated as if UPGRADE_TO_HIGHEST_SLOT=true.
ru: Если UPGRADE_TO_HIGHEST_SLOT=false, то для пакетов, перечисленных в этих файлах/каталогах, будет принято UPGRADE_TO_HIGHEST_SLOT=true.

source: Entries listed in these files/dirs are excluded for -t TEST_KEYWORDS.
ru: К пакетам, перечисленным в данных файлах/каталогах, не применяется опция -t TEST_KEYWORDS.

source: Entries listed in these files/dirs are excluded for -t TEST_MASK.
ru: К пакетам, перечисленным в данных файлах/каталогах, не применяется опция -t TEST_MASK.

source: Entries listed in these files/dirs are excluded for -t TEST_UNMASK.
ru: К пакетам, перечисленным в данных файлах/каталогах, не применяется опция -t TEST_UNMASK.

source: Entries listed in these files/dire are excluded for -t TEST_USE.
ru: К пакетам, перечисленным в данных файлах/каталогах, не применяется опция -t TEST_USE.

source: Entries listed in these files/dire are excluded for -t TEST_ENV.
ru: К пакетам, перечисленным в данных файлах/каталогах, не применяется опция -t TEST_ENV.

source: Entries listed in these files/dirs are excluded for -t TEST_LICENSE.
ru: К пакетам, перечисленным в данных файлах/каталогах, не применяется опция -t TEST_LICENSE.

source: Entries listed in these files/dirs are excluded for -t TEST_CFLAGS.
ru: К пакетам, перечисленным в данных файлах/каталогах, не применяется опция -t TEST_CFLAGS.

source: Packages listed in these files/dirs are excluded for -t TEST_REMOVED.
ru: К пакетам, перечисленным в данных файлах/каталогах, не применяется опция -t TEST_REMOVED.

source: This variable is only used for delayed substitution in PACKAGE_NOWARN. It is meant to be a local addition to PACKAGE_NOWARN.
ru: Эта переменная используется только для отложенной подстановки в PACKAGE_NOWARN. Она должна быть локальным дополнением к PACKAGE_NOWARN.

source: This variable is only used for delayed substitution in PACKAGE_NOWARN. If it is set then the files from OBSOLETE_PACKAGE_NOWARN are used.
ru: Эта переменная используется только для отложенной подстановки ы PACKAGE_NOWARN. Если она установлена, будут использоваться файлы из OBSOLETE_PACKAGE_NOWARN.

source: This variable is used for delayed substitution in PACKAGE_NOWARN if the variable OBSOLETE_NOWARN is set.
ru: Эта переменная используется для отложенной подстановки в PACKAGE_NOWARN если переменная OBSOLETE_NOWARN установлена.

source: This file/directory contains exceptions for -T tests.
ru: Этот файл/каталог содержит исключения для проверок с опцией -T.

source: This variable is only used for delayed substitution. It specifies directories for EIX_LOCAL_SETS.
ru: Эта переменная используется только для отложенной подстановки. Она определяет каталоги для EIX_LOCAL_SETS.

source: This is a space-separated list of directories containing set definitions.
ru: Здесь через пробел перечисляются каталоги, содержащие установленные назначения.

source: This regular expression describes the recognized EAPIs in .ebuild suffixes. You might need to modify it according to the installed portage version. Leave it empty if EAPI-suffixed ebuilds (GLEP 55) should be ignored.
ru: Это регулярное выражение описывает найденные EAPI суффиксах .ebuild. Вам может понадобиться изменить его в зависимости от установленной версии portage. Оставьте его пустым, если необходимо игнорировать ебилды с суффиксом EAPI (GLEP 55).

source: This variable is ignored. You can use it to collect delayed references to locally added (unused) variables so that they are printed with --dump.
ru: Эта переменная игнорируется. Вы можете использовать ее для сбора отложенных указателей на добавленные локально (неиспользуемые) переменные, так чтобы они выводились с опцией --dump.

source: fatal config error: %s in delayed substitution of %s
ru: фатальная ошибка конфигурации: %s в отложенной подстановке %s

source: FI without IF
ru: FI без IF

source: ELSE without IF
ru: ELSE без IF

source: self-reference
ru: рекурсия

source: double ELSE
ru: ELSE повторяется дважды

source: IF without FI
ru: IF без FI

source: No $HOME found in environment.
ru: В среде не найдена $HOME.

source: or
ru: или

source: %s has unknown value %r assuming value 'all-installed' instead.
ru: %s имеет неизвестное значение %r будет использовано значение 'all-installed'.

source: was locally changed to:
ru: изменена локально, новое значение:

source: changed locally, default was:
ru: изменена локально, предыдущее значение по умолчанию:

source: locally added:
ru: добавлена локально:

source: Received SIGSEGV - you probably found a bug in eix. Please proceed with the following few instructions and help us find the bug: * install gdb (sys-dev/gdb) * reemerge eix with FEATURES="nostrip" USE="debug" or with FEATURES="nostrip" CXXFLAGS="-g -ggdb3" LDFLAGS="" * enter gdb with "gdb --args %s your_arguments_for_%s" * type "run" and wait for the segfault to happen * type "bt" to get a backtrace (this helps us a lot) * post a bugreport and be sure to include the output from gdb .. Sorry for the inconvenience and thanks in advance!
ru: Получено SIGSEGV - вероятно, вы обнаружили ошибку в eix. Пожалуйста, следуйте изложенным ниже инструкциям, чтобы сообщить нам об этой ошибке: * установите gdb (sys-dev/gdb) * пересоберите eix с выставленными FEATURES="nostrip" USE="debug" или с FEATURES="nostrip" CXXFLAGS="-g -ggdb3" LDFLAGS="" * введите gdb в следующем формате: "gdb --args %s ваши аргументы для %s" * введите "run" и дождитесь ошибки сегментации * введите "bt" для вывода отчета об операциях, вызвавших ошибку (нам это очень поможет) * разместите сообщение об ошибке, обязательно приложив вывод gdb .. Сожалеем за причиненные неудобства и заранее благодарим вас за внимание.

source: Unknown property %r
ru: Неизвестное свойство %r

source: Property %r used outside version context
ru: Свойство %r использовано вне контекста версии.

source: Variable %r calls itself for printing
ru: Переменная %r вызывает сама себя для вывода

source: Internal error: bad node for parse_colors.
ru: Внутренняя ошибка: parse_colors столкнулась с элементом неверного типа.

source: '(' without closing ')'
ru: '(' без закрывающей ')'

source: Error while parsing color: %s
ru: Ошибка при парсинге цвета: %s

source: '<' without closing '>'
ru: '<' без закрывающей '>'

source: No name of property/variable found after '{'.
ru: Не найдено имени свойства/переменной после '{'.

source: Found '{' without closing '}'.
ru: Найдена '{' без закрывающей '}'.

source: Unexpected symbol %r found after '{'.
ru: После '{' найден неожиданный символ %r.

source: Found ELSE without IF.
ru: Найдено ELSE без IF.

source: Found FI without IF.
ru: Найдено FI без IF.

source: Check your syntax
ru: Проверьте синтаксис

source: Bad state: ERROR
ru: Статус ошибки: ОШИБКА

source: Bad state: STOP
ru: Статус ошибки: СТОП

source: Bad state: undefined
ru: Статус ошибки: не определено

source: Line %r, column %r: %s
ru: Строка %r, столбец %r: %s

source: internal error: unknown PartType on (%r,%r)
ru: внутренняя ошибка: неизвестный PartType на (%r,%r)

source: malformed (first primary at %r) version string %r
ru: ошибка (первое первичное выражение в %r) в строке версии %r

source: malformed (primary at %r) version string %r
ru: ошибка (первичное выражение в %r) в строке версии %r

source: malformed (suffix at %r) version string %r
ru: ошибка (суффикс в %r) в строке версии %r

source: garbage (%s) at end of version %r accepting version anyway
ru: мусор (%s) в конце версии %r тем не менее версия принимается

source: Recursion level for cascading profiles exceeded; stopping reading parents
ru: Превышен максимально допустимый уровень рекурсии для каскадных профилей; считывание родительских записей остановлено.

source: internal error: Tried to restore nonlocal mask without saving
ru: внутренняя ошибка: была предпринята попытка восстановить нелокальную маску без сохранения

source: Can't read category.
ru: Невозможно прочитать категорию.

source: Repository name must be separated with :: (one : is missing)
ru: Разделителем имен репозиториев должен быть :: (не хватает одного знака :)

source: You have a operator but we can't find a version-part.
ru: Вы ввели оператор, но версия не обнаружена.

source: A '*' is only valid at the end of a version-string.
ru: Астериск '*' может использоваться только в конце строки версии.

source: A wildcard is only valid with the = operator.
ru: Подстановочный знак может использоваться только с оператором =.

source: A wildcard is only valid with the = operator. Portage would also accept something like ~app-shells/bash-3*, but behave just like ~app-shells/bash-3.
ru: Подстановочный знак может использоваться только с оператором =. Хотя portage и примет запись вида ~app-shells/bash-3*, обрабатывать он будет ~app-shells/bash-3.

source: internal error: SetStability calculates wrong index
ru: внутренняя ошибка: неверный индекс SetStability

source: warning: ignoring --close without --open
ru: внимание: без --open --close игнорируется

source: cannot find match field %r
ru: поле соответствия %r не найдено

source: cannot find match algorithm %r
ru: алгоритм соответствия %r не найден
