Repository: gentoo-mirror/calculate
Catalog: app-portage/eix/files/*.po
Languages: ru

source: Problems running ${eixf_cmd}
ru: ${eixf_cmd} работает некорректно

source: Calling eix-update
ru: Вызов eix-update

source: eix-update failed
ru: Ошибка eix-update

source: ${eixf_patha} cannot be found in path
ru: Не найден ${eixf_patha} по пути

source: found no free tempname after 10000 attempts
ru: сделано 10000 попыток, свободное временное имя не найдено

source: cannot create temporary directory
ru: не удается создать временный каталог

source: cannot create temporary file
ru: не удается создать временный файл

source: Usage: ${n} [options] ARG [ARG ARG ...] This script is part of ${p}. It outputs all installed packages, or packages installed with/without repository or buildtime information. Packages emerged with new version of portage contain repository and buildtime information. It is advantageous but not mandatory for eix to have this (see CHECK_INSTALLED_OVERLAYS and USE_BUILD_TIME in the eix manpage). ARG determines which packages are output: all - output all installed packages repo - output packages installed with repository information. no-repo - output packages installed without repository information. buildtime - output packages installed with buildtime information. no-buildtime - output packages installed without buildtime information. The following options are available: -= Output packages prefixed with "=" -q Output only packages, no explaining text -a Substitute for "-q all" (ARG is ignored) ARG can be abbreviated, e.g. instead of "no-repo" you can use "nr".
ru: Синтаксис: ${n} [опции] АРГУМЕНТ [АРГУМЕНТ АРГУМЕНТ ...] Этот скрипт является частью ${p}. Он выводит все установленные пакеты, либо пакеты, установленные с указанием/без указания данных о репозитории или времени сборки. Пакеты, собранные новой версией portage, содержат информацию о репозитории ивремени сборки. Это удобная, но не обязательная опция для eix (см. CHECK_INSTALLED_OVERLAYS и USE_BUILD_TIME на man-странице eix). АРГУМЕНТ определяет, какие пакеты будут выведены: all - выводит все установленные пакеты. repo - выводит пакеты, установленные с данными о репозитории. no-repo - выводит пакеты, установленные без данных о репозитории. buildtime - выводит пакеты, установленные с указанием времени сборки. no-buildtime - выводит пакеты, установленные без указания времени сборки. Доступны следующие опции: -= Вывести пакеты с префиксом "=" -q Вывести только сами пакеты, без пояснений -a Заменить все " на "-q (игнорировать АРГУМЕНТ) Можно использовать сокращение АРГУМЕНТа, например, "nr" вместо "no-repo".

source: (total number of versions listed above: ${c})
ru: (всего версий в списке: ${c})

source: The following package versions are installed:
ru: Установлены следующие версии пакетов:

source: The following package versions are installed with repository information:
ru: Следующие версии пакетов установлены с данными о репозитории:

source: The following package versions are installed without repository information:
ru: Следующие версии пакетов установлены без данных о репозитории:

source: The following package versions are installed with build-time information:
ru: Следующие версии пакетов установлены с указанием времени сборки:

source: The following package versions are installed without build-time information:
ru: Следующие версии пакетов установлены без указания времени сборки:

source: cannot locate your database of installed packages
ru: ваша база данных установленных пакетов не найдена

source: Usage: ${n} [options] category/package[:slot] This is a well-commented demo script for eix (${p}). It lists packages installed after (or before) the last (or first) install of the given package/version in an output format which is convenient as an argument for "emerge -1". Be aware that only packages in the eix database are considered. The argument can use shell pattern matching (* and ?; do not forget to quote them if you call this script from a shell); the first match is chosen. The :slot part can be omitted if the corresponding package has only one slot. (Options -l, -L, and -e have different rules). The following options are available: -f Output full list of all packages (no further argument required) -b Output packages installed before (instead of after) the given package -i Include the given package (on the command line) in the output -l Use /var/log/emerge.log to use the _first_ (instead of the last) install time of the given package. In this case, the argument must be a regular expression matching category/package-version. Note that the time in the log file and the time recorded in the database usually differ slightly so that usage/non-usage of option -i need not have the expected effect: The package may or may not be included. You can use -a/-A to fix the time. Note also that -t or -T have no effect on the data in the log file. -L LOG As -l but use LOG instead of /var/log/emerge.log -e The argument is not category/package[:slot] but a time in the format output by "date +%s" (i.e. the number of seconds since epoch). -a SEC When using -l -L or -e, increase the actual match time by SEC seconds. -A SEC When using -l -L or -e, decrease the actual match time by SEC seconds. -S When finding the starting package, choose the first matching slot -V When finding the starting package, look for category/package-version instead of category/package:slot -d Output the installation date after the package -s Output slot of the package, even if there appears no ambiguity -v Output category/package-version instead of category/package[:slot] -= Output =category/package-version instead of category/package[:slot] -t Use build time (if available) instead of installation time, independent of the value of USE_BUILD_TIME -T Never use build time
ru: Синтаксис: ${n} [опции] категория/пакет[:слот] Это подробно документированный демо-скрипт для eix (${p}). Он выводит пакеты, которые были установлены после (или до) последней (или первой) установки данного пакета/версии, в удобном для просмотра формате как аргумент для "emerge -1". Имейте в виду, что скрипт учитывает только пакеты, содержащиеся в базе данных eix. В аргументе могут быть использованы подстановочные знаки (* и ?; не забудьте поставить их в кавычки, если скрипт вызывается из оболочки); при этом берется первое совпадение с шаблоном. Аргумент "":слот"" может быть опущен, если соответствующий пакет имеет лишь один слот. (Опции -l, -L и -e подчиняются другим правилам). Доступны следующие опции: -f Будет выведен полный список пакетов (других аргументов не требуется) -b Будут выведены пакеты, установленные до (а не после) указанного пакета -i Данный пакет (в командной строке) будет включен в вывод скрипта -l /var/log/emerge.log будет применен к _первому_ (а не последнему) времени установки указанного пакета. В этом случае аргумент должен быть регулярным выражением синтаксиса категория/пакет-версия. Обратите внимание, что время, указанное в файле отчета, и время, фигурирующее в базе данных, как правило, несколько различаются, поэтому использование/отказ от использования опции -i не обязательно сработает ожидаемым образом: пакет может учитываться, а может и не учитываться. Для коррекции времени вы можете использовать опцию -a/-A. Заметьте также, что опция -t и -T не повлияет на данные в файле отчета. -L ОТЧЕТ Как -l, но вместо /var/log/emerge.log будет использован ОТЧЕТ -e Данный аргумент не имеет синтаксиса категория/пакет[:слот] - это время, выводимое в формате "date +%s" (т.е. время в секундах, прошедшее с момента epoch). -a СЕКУНД При использовании -l, -L или -e время сопоставления будет увеличено на указанное количество СЕКУНД. -A СЕКУНД При использовании -l, -L или -e время сопоставления будет уменьшено на указанное количество СЕКУНД. -S При нахождении первого пакета будет использован первый найденный слот -V При нахождении первого пакета будет осуществлен поиск по шаблону категория/пакет-версия, а не категория/пакет:слот -d Вслед за пакетом будет выведена дата установки -s Будет выведен слот пакета, даже если нет двусмысленности -v Вывод будет выполнен в формате категория/пакет-версия, а не категория/пакет[:слот] -= Вывод будет выполнен в формате =категория/пакет-версия, а не категория/пакет[:слот] -t Использовать время сборки (если доступно) вместо времени установки, независимо от значения USE_BUILD_TIME -T Никогда не учитывать время сборки

source: cannot read ${logfile}
ru: невозможно прочитать ${logfile}

source: cannot find merge of ${match} in ${logfile}
ru: не найдена сборка ${match} в ${logfile}

source: Usage: ${n} [options] command Add or remove local layman overlays to the eix database (${p}). Explanation: If your /etc/make.conf does not source layman/make.conf, then the layman overlays are not considered as part of you PORTDIR_OVERLAY; in this case, they are are usually not added to your eix database and thus cannot be found with eix. However, you might want to add/remove them temporarily to your eix database without changing your /etc/make.conf. This is the purpose of this script. This script is also meant as an example how to use eix-functions.sh. The following commands are provided: add: Add the local layman overlays to the eix database remove: Remove the local layman overlays from the eix database. Available options: -a OVERLAY Add overlay to the list of layman overlays. -A PATH Add PATH to the sourced make.confs used to determine the layman overlays. Current value:
ru: Синтаксис: ${n} [опции] команда Добавление или удаление оверлеев в локальной базе данных eix (${p}). Пояснение: Если в вашем /etc/make.conf не прописан layman/make.conf, оверлеи layman будут описываться переменной PORTDIR_OVERLAY; в таком случае они, как правило, не добавляются в базу данных eix и, следовательно, eix их не увидит. Однако вы можете временно поместить такие оверлеи в вашу базу данных eix или удалить их из нее, не внося изменений в /etc/make.conf. Именно для этого предназначен этот скрипт. Он также может служить примером использования eix-functions.sh. Применяются следующие команды: add: Добавляет локальные оверлеи layman в базу данных eix remove: Удаляет локальные оверлеи layman из базы данных eix. Доступные опции: -a ОВЕРЛЕЙ Добавить оверлей к списку оверлеев layman. -A ПУТЬ Прописать в make.conf путь для оверлеев layman. Текущее значение:

source: none (i.e. no readable layman make.conf specified)
ru: нет (т.е. отсутствует корректный make.conf для layman)

source: -C Clear the above list -c LAYMAN_CFG Use layman.cfg file to determine entry for above list -v Verbose (default) -q Quiet
ru: -C Очистить выведенный список -c LAYMAN_CFG Использовать файл layman.cfg для определения записей в списке -v Подробно (по умолчанию) -q Кратко

source: Usage: ${n} [options] command [FILE] Get data from a remote datebase for ${p}. The following commands are provided: update: Fetch the eix-caches of some layman overlays into a temporary file resp. into FILE and add them to the eix database. To keep this data across eix-update calls, you might want to set KEEP_VIRTUALS=true in /etc/eixrc (or in ~/.eixrc) fetch: Only fetch the overlays into FILE. add: Only add the overlays from FILE to the eix database. remove: Remove all temporarily added virtual overlays from the eix database; this is similar to KEEP_VIRTUALS=false eix-update but faster (without actual updating where possible). It is strongly recommended to use the update/fetch commands with very limited permissions. Permissions are dropped when run as root (cf. default in -U) or when the -u option is specified. Do not use "-u root"! For "update" and "add" all corresponding local layman overlay paths are excluded from the update of the current database to avoid confusion. These local paths are determined by prefixing the path ${LOCAL_LAYMAN} You can modify this value with the -l option or by setting the environment variable LOCAL_LAYMAN. If you do not want this feature (i.e. if you want to see your local layman overlays and the remote layman overlays), use here some path not containing any overlays (usually "/" will do). Options can be specified in the eix (or environment) variable EIX_REMOTE_OPTS. This data is evalued, so be aware of security risks. Moreover, "--" in this variable will exclude further command line options. The following options are available: -f FILE This is the same as giving FILE as the last argument. This is mainly useful for default options. Current value: ${f} -u USER Call wget as USER. Ignored if not set unless you are root. -U USER Call wget as USER if called as root. Currently "${fetchroot}" -s/-S Use sudo/su to change user permission. Currently: ${suprg} -l PATH Use PATH as LOCAL_LAYMAN -a ADDR Use ADDR as remote database address. Current value: ${addr} -i Ignore all previous options (e.g. of local defaults). -v Verbose (default) -q Quiet
ru: Синтаксис: ${n} [опции] команда [ФАЙЛ] Получение данных из удаленной базы данных для ${p}. Применяются следующие команды: update: Записать кэш-файлы eix для ряда оверлеев layman во временный файл, а именно в ФАЙЛ, и добавить их в базу данных eix. Чтобы эти данные не перезаписывались при вызовах eix-update, следует установить значение KEEP_VIRTUALS=true в файле /etc/eixrc (или ~/.eixrc) fetch: Только записать оверлеи в ФАЙЛ. add: Только добавить оверлеи из ФАЙЛа в базу данных eix. remove: Удалить все временно добавленные виртуальные оверлеи из базы данных eix; эта команда аналогична KEEP_VIRTUALS=false eix-update, но работает быстрее (поскольку там, где обновление не нужно, его не происходит). Убедительно рекомендуется использовать команды update/fetch с крайне ограниченными правами. Права сбрасываются при запуске от root'а (ср. значения по умолчанию при -U) или если выставлена опция -u. Не применяйте "-u root"! При использовании команд "update" и "add" все соответствующие пути локальных оверлеев layman исключаются из обновления текущей базы данных, во избежание ошибок. Эти локальные пути указываются в префиксе пути ${LOCAL_LAYMAN} Вы можете изменить данное значение, выставив опцию -l или определив значение переменной окружения LOCAL_LAYMAN. Если вам это не нужно (т.е. если вы хотите видеть ваши локальные и удаленные оверлеи layman), укажите путь, по которому нет оверлеев (в большинстве случаев удобно использовать "/"). Опции могут указываться в переменной eix (или переменной окружения) EIX_REMOTE_OPTS. Эти данные анализируются, поэтому учитывайте риски безопасности. Заметьте также, что "--" в данной переменной исключает использование последующих опций в командной строке. Доступны следующие опции: -f ФАЙЛ Аналогично назначению ФАЙЛа последним аргументом. Целесообразно использовать главным образом для опций по умолчанию. Текущее значение: ${f} -u ПОЛЬЗОВАТЕЛЬ wget будет запущен от ПОЛЬЗОВАТЕЛя. Когда значение не установлено, опция игнорируется, если только вы не работаете из-под root'а. -U ПОЛЬЗОВАТЕЛЬ wget будет запущен от ПОЛЬЗОВАТЕЛЯ, если вызван от root'а. Текущее значение: "${fetchroot}" -s/-S Для изменения прав доступа будет использован sudo/su. Текущее значение: ${suprg} -l ПУТЬ ПУТЬ будет использован как LOCAL_LAYMAN -a АДРЕС АДРЕС будет использован как адрес удаленной базы данных. Текущее значение: ${addr} -i Будут проигнорированы все предыдущие опции (например, локальные умолчания). -v Подробно (по умолчанию) -q Кратко

source: $LOCAL_LAYMAN must not be empty
ru: $LOCAL_LAYMAN не должна быть пуста

source: $LOCAL_LAYMAN must start with /
ru: $LOCAL_LAYMAN должна начинаться с /

source: Filename argument is mandatory
ru: Имя файла - обязательный аргумент

source: cannot cd to ${a}
ru: невозможно перейти в каталог ${a}

source: remote address is not properly set. Please specify a valid remote file with option -a. The default should have been set with ./configure --remote-file
ru: неверный удаленный адрес. Пожалуйста, укажите правильный адрес удаленного файла с опцией -a. Значение по умолчанию должно было быть установлено с помощью ./configure --remote-file

source: Fetching ${eixcachesname}
ru: Получение ${eixcachesname}

source: could not fetch ${addr}
ru: ${addr} не был получен

source: Probably your eix cachefile was *not* updated successfully. Unless the above messages suggest another cause or you specified a wrong filename, the most likely cause of this is that the server uses another eix version than you or produced broken data. Please inspect ${archive} whether this is a valid *.tar.bz2 archive containing eix cachefiles (if it has already been deleted, download it using fetch). If this is not the case (but was freshly downloaded), please report a bug. Note that the archive is *not* broken if only the cachefile format versions differ: In that case only report a bug if the eix cachefile format versions in the downloaded file are *older* than that of the most current ~x86 eix version in the portage tree (but first retry after several days before reporting such a bug to give the server maintainers a chance to upgrade after a version bump of eix). Conversely, if the downloaded versions are even newer than that supported by your eix, you will have to upgrade to the most current ~x86 version of eix to use eix-remote: This inconvenience cannot be avoided and is not a bug!
ru: Возможно, файл кэша eix *не был* корректно обновлен. Если в сообщениях системы не указана другая причина ошибки и вы не ошиблись в имени файла, вероятнее всего, проблема вызвана тем, что сервер использует другую версию eix, или что ошибку содержат переданные им данные. Пожалуйста, проверьте, является ли ${archive} корректным *.tar.bz2-архивом кэш-файлов eix (если архив уже был удален, скачайте его с помощью fetch). Если этот архив (свежескачанный) не вызывает подозрений, сообщите нам об ошибке. Заметьте, что архив *не* нарушен, если различаются только версии формата кэш-файлов eix: в этом случае сообщайте об ошибке, только если версия формата кэш-файла eix скачанного файла *ниже*, чем версия основной ~x86-версии в портежах(тем не менее, прежде чем оформлять ошибку, повторите попытку через несколько дней: к тому моменту майнтейнеры, возможно, произведут мажорное обновление eix). Если же, напротив, версия скачанного файла выше поддерживаемой вашим eix, вам потребуется обновиться до основной ~x86-версии eix, чтобы вы могли использовать eix-remote: эта проблема решаема и не является ошибкой!

source: cannot unpack ${a}
ru: не удается распаковать ${a}

source: problems arised with cachefile ${i}
ru: возникла проблема с кэш-файлом ${i}

source: could not read all eix cachefiles of ${a}
ru: не удается прочитать все кэш-файлы ${a}

source: cannot read ${filename}
ru: не удается прочитать ${filename}
