Repository: gentoo-mirror/calculate
Catalog: app-portage/eix/files/*.po
Languages: ru

source: Usage: ${n} [options] Call layman/emerge --sync/--metadata and/or show updates. (${p}) Unless the -t option is used, the old database will be saved to ${eixprevious}. The file ${eixsyncconf} and the eix (environment) variable EIX_SYNC_CONF (which defaults to delayed substitution of EIX_SYNC_OPTS) determine for which overlays layman is called, which default options are used, and they can contain various hooks - "man eix" for details. Be aware that e.g. the default EIX_SYNC_OPTS are evaluated so be sure to quote them correctly and care about security risks. Moreover, "--" in the default options will forbid command line options. The following options are available: -i Ignore all previous options (useful to ignore ${eixsyncconf} options). -d Only show differences to the previously saved database and exit. Except for executing the !! lines in ${eixsyncconf} this is the same as eix-diff ${eixprevious}. -s [USER@]SERVER[:DIR] Sync via rsync from SERVER. USER defaults to current user and DIR defaults to PORTDIR. An empty SERVER cancels this option. This option implies -0 -0 No eix --sync -2 [USER@]CLIENT[:DIR] Sync via rsync *to* CLIENT after successfull syncing; you should later call eix-sync -u locally on CLIENT. If you already have synced you might want to combine this option with -uU. -U Do not touch the database and omit the hooks after eix-update (@ entries) and do not show differences. This option implies -R -u Update database only and show differences. This is equivalent to -0l@s "" -l Do not call layman (and the !commands in ${eixsyncconf}). However, the !! lines and postponed hooks (@ and @@ entries) will be executed anyway. -@ Do not execute the hooks (@ and @@ entries) of ${eixsyncconf}. -S Do not execute the hooks after emerge --sync (@ entries). -M Run emerge --metadata. You might need this when you use e.g. PORTDIR_CACHE_METHOD=flat and a newer portage version when FEATURES=metadata-transfer is inactive or disabled. -N Cancel a previous -M. -t Use temporary file to save the current database (-d will not be possible). -T Do not measure time -q Be quiet (close stdout) -w Run emerge-webrsync instead of emerge --sync. -W Run emerge-delta-webrsync instead of emerge --sync. -c CMD Run CMD instead of emerge --sync. -C OPT Add OPT to the emerge --sync command (or whatever is used instead). This option can be used accumulatively. -o OPT Add OPT to each eix-update command. This option can be used accumulatively. -L OPT Add OPT to each call of layman. This option can be used accumulatively. -r Clear /var/cache/edb/dep/* before syncing. This is only useful when you use e.g. PORTDIR_CACHE_METHOD=flat and FEATURES=metadata-transfer is active. (This option is not default anymore). -R Cancel previous -r (e.g. if it was used in ${eixsyncconf}). -e Skip heuristic tests whether you must be root. -h Show this text and exit.
ru: Синтаксис: ${n} [опции] Вызывает layman/emerge --sync/--metadata и/или показывает обновления. (${p}) Если не используется опция -t, старая база данных будет сохранена как ${eixprevious}. Файл ${eixsyncconf} и переменная (окружения) eix EIX_SYNC_CONF (по умолчанию выполняет отложенную подстановку EIX_SYNC_OPTS) определяют, для каких оверлеев вызывается layman, какие опции используются по умолчанию; они могут содержать различные ловушки - подробнее см."man eix". Заметьте, что, например, значения EIX_SYNC_OPTS по умолчанию анализируются, поэтому убедитесь, что кавычки расставлены правильно, и учитывайте риски безопасности. Кроме того, выставление "--" в опциях по умолчанию сделает невозможным использование опций в командной строке. Доступны следующие опции: -i Игнорировать все предыдущие опции (удобно, если нужно проигнорировать опции ${eixsyncconf}). -d Отобразить отличия от ранее сохраненной базы данных и выйти. За исключением исполнения строк !! в ${eixsyncconf}, эта команда работает аналогично eix-diff ${eixprevious}. -s [ПОЛЬЗОВАТЕЛЬ@]СЕРВЕР[:КАТАЛОГ] Произвести синхронизацию с СЕРВЕРОМ. ПОЛЬЗОВАТЕЛЬ по умолчанию - текущий пользователь, а КАТАЛОГ по умолчанию - PORTDIR. Если не указать СЕРВЕР, эта опция не будет работать. Опция подразумевает -0 -0 Не выполнять eix --sync -2 [ПОЛЬЗОВАТЕЛЬ@]КЛИЕНТ[:КАТАЛОГ] После успешной синхронизации синхронизировать *КЛИЕНТА*; в дальнейшем следует выполнить eix-sync -u локально на КЛИЕНТЕ. Если вы уже проводили синхронизацию, эту опцию может быть полезно использовать совместно с -uU. -U Не подвергать базу данных изменениям и убрать ловушки после выполнения eix-update (записи @); отличия не будут отображены. Данная опция подразумевает -R -u Обновить только базу данных и вывести отличия. Работает аналогично -0l@s "" -l Не вызывать layman (и команды ! в ${eixsyncconf}). Тем не менее строки !! и отложенные ловушки (записи @ и @@) будут выполняться. -@ Не выполнять ловушки (записи @ и @@) в ${eixsyncconf}. -S Не выполнять ловушки после emerge --sync (записи @). -M Выполнить emerge --metadata. Это может понадобиться, например, если вы используете PORTDIR_CACHE_METHOD=flat и более новую версию portage, когда FEATURES=metadata-transfer неактивно или отключено. -N Отменяет предыдущую опцию -M. -t Сохранить текущую базу данных во временном файле (опция -d при этом недоступна). -T Не замерять время. -q Краткий вывод (close stdout) -w Выполнить emerge-webrsync вместо emerge --sync. -W Выполнить emerge-delta-webrsync вместо emerge --sync. -c КОМАНДА Запустить КОМАНДУ вместо emerge --sync. -C ОПЦИЯ ОПЦИЯ будет добавлена к emerge --sync (или к другой команде, используемой вместо нее). Эта опция может применяться кумулятивно. -o ОПЦИЯ ОПЦИЯ будет добавляться при каждом вызове команды eix-update. Эта опция может применяться кумулятивно. -L ОПЦИЯ ОПЦИЯ будет добавляться при каждом вызове layman. Эта опция может применяться кумулятивно. -r /var/cache/edb/dep/* будет очищен перед синхронизацией. Эта опция имеет смысл, только если вы используете, например, PORTDIR_CACHE_METHOD=flat и действует FEATURES=metadata-transfer. (Ранее она выставлялась по умолчанию). -R Отменяет предыдущую опцию -r (например, если та была использована в ${eixsyncconf}). -e Пропустить эвристическую проверку, необходимо ли выполнять операции от root'а. -h Отобразить этот текст и выйти.

source: No previous database ${eixprevious} exists
ru: Более ранней базы данных ${eixprevious} не существует

source: Could not execute eix-diff
ru: Не удалось выполнить eix-diff

source: Something went wrong with ${curr_cmd}
ru: Ошибка ${curr_cmd}

source: Syncing all portage overlays
ru: Синхронизируются все оверлеи portage

source: ${mycmd} -S failed
ru: Не удалось выполнить ${mycmd} -S

source: Syncing portage overlay ${j}
ru: portage синхронизирует оверлей ${j}

source: ${mycmd} -s ${j} failed
ru: Не удалось выполнить ${mycmd} -s ${j}

source: eix-sync -m is obsolete; use -M0 instead
ru: Команда eix-sync -m устарела; используйте опции -M0

source: Nothing was executed, because a heuristic shows that root permissions are required to execute everything successfully.
ru: Ничего не было сделано, поскольку эвристический анализ показал, что для успешного выполнения всех операций требуются права администратора.

source: However, the heuristic might be wrong, e.g. if you use EPREFIX. If you want to skip this test temporarily, use option -e. If you want to skip this test permanently, put option -e into the file ${eixsyncconf}.
ru: Однако результаты эвристической проверки могут быть ошибочными, например, если вы используете EPREFIX. Если вы хотите пропустить эту проверку сейчас, используйте опцию -e. Если вы хотите всегда пропускать эту проверку, выставите опцию -e в файле ${eixsyncconf}.

source: %6d seconds for %s\n
ru: %6d секунд для %s\n

source: Time statistics:
ru: Статистика по времени:

source: initial eix-update
ru: первоначальный запуск eix-update

source: syncing
ru: синхронизация

source: client syncing
ru: синхронизация клиента

source: metadata update
ru: обновление метаданных

source: %6d seconds total\n
ru: всего %6d секунд\n

source: ${curr_cmd} failed
ru: Ошибка ${curr_cmd}

source: Removing old portage-cache in ${local_varcache}/var/cache/edb/dep
ru: Удаляется устаревший кэш portage из ${local_varcache}/var/cache/edb/dep

source: rm -rf ${local_varcache}/var/cache/edb/dep/* failed
ru: Не удалось выполнить rm -rf ${local_varcache}/var/cache/edb/dep/*

source: Could not rsync from ${hostdir}
ru: Не удалось выполнить rsync с ${hostdir}

source: Running ${runarg}
ru: Выполняется ${runarg}

source: ${runarg} failed
ru: Не удалось выполнить ${runarg}

source: rsyncing to ${hostdir}
ru: Выполняется rsync для ${hostdir}

source: Could not rsync to ${hostdir}
ru: Не удалось выполнить rsync для ${hostdir}

source: Running emerge --metadata
ru: Выполняется emerge --metadata

source: emerge --metadata failed
ru: Не удалось выполнить emerge --metadata

source: eix-cache does not exist. Running eix-update!
ru: eix-cache не существует. Будет запущен eix-update!

source: eix-cache format has changed. Running eix-update!
ru: Формат eix-cache изменился. Будет запущен eix-update!

source: Could not copy database to temporary file ${tmpfile}
ru: Не удалось копировать базу данных во временный файл ${tmpfile}

source: Copying old ${eixcache} cache to ${eixprevious}
ru: Копируется более ранний кэш ${eixcache} в ${eixprevious}

source: Could not move ${tmpfile} to ${eixprevious}
ru: Невозможно переместить содержимое ${tmpfile} в ${eixprevious}

source: eix-update was apparently already called in a hook
ru: Вероятно, eix-update уже вызывался ловушкой

source: Running eix-update
ru: Выполняется eix-update

source: Failure while running eix-update
ru: Ошибка при выполнении eix-update

source: Calling eix-diff
ru: Вызывается eix-diff

source: Failed to diff against current cache
ru: Не удалось определить различия между новой и кэшированной версией

source: ROOT_UID [${root_uid}] is not a number
ru: ROOT_UID [${root_uid}] не является числом

source: Usage: ${n} [options] detail|brief This is a wrapper script for eix (${p}). It calls eix -tTc several times with various variable settings in order to display missing packages or packages with obsolete entries in /etc/portage/package.* in a more organized manner than eix -tTc would do alone. The speed and displayed details depend on whether you use the argument "detail" or "brief". Note that the result depends on your settings of the REDUNDANT_IF_* and NONEXISTENT_IF_* variables. In particular, the variables REDUNDANT_IF_{IN,DOUBLE}_{USE,ENV,CFLAGS} and REDUNDANT_IF_MIXED are false by default. Thus, e.g. to activate the two possible tests for /etc/portage/package.use you should set something like REDUNDANT_IF_IN_USE="-some" REDUNDANT_IF_DOUBLE_USE="some". The following options are available: -c use CHECK_INSTALLED_OVERLAYS=true -C use CHECK_INSTALLED_OVERLAYS=repository -d This can be used instead of the argument "detail" -b This can be used instead of the argument "brief" -h Show this help text Options -b and -d are meant as to be used in EIX_TEST_OBSOLETE_OPTS to specify the default behavior. If neither -c nor -C is used, then CHECK_INSTALLED_OVERLAYS is not modified. The (recommended) default for CHECK_INSTALLED_OVERLAYS is \"repository\" which is much faster than CHECK_INSTALLED_OVERLAYS=true but works only reliable for packages installed with repository information (which is done by all recent portage versions). The argument can be abbreviated, e.g. instead of "brief" you can just use "b".
ru: Синтаксис: ${n} [опции] detail|brief Это скрипт-обертка для eix (${p}). Он вызывает eix -tTc несколько раз с различными значениями переменных для отображения недостающих пакетов или пакетов, содержащих устаревшие данные, в /etc/portage/package.*, и делает это более эффективно, нежели eix -tTc, вызываемый отдельно. Скорость и объём отображаемой информации зависят от того, используете ли вы аргумент "detail" или "brief". Заметьте, что результат зависит от установленных вами значений переменных REDUNDANT_IF_* и NONEXISTENT_IF_*. В частности, переменные REDUNDANT_IF_{IN,DOUBLE}_{USE,ENV,CFLAGS} и REDUNDANT_IF_MIXED по умолчанию имеют значение false. Таким образом, чтобы, например, сделать доступными две возможные проверки для /etc/portage/package.use, вы должны установить значения переменных подобным образом: REDUNDANT_IF_IN_USE="-some" REDUNDANT_IF_DOUBLE_USE="some". Доступны следующие опции: -c Использовать CHECK_INSTALLED_OVERLAYS=true -C Использовать CHECK_INSTALLED_OVERLAYS=repository -d Данную опцию можно использовать вместо аргумента "detail" -b Данную опцию можно использовать вместо аргумента "brief" -h Вывести текст справки Опции -b и -d следует использовать в переменной EIX_TEST_OBSOLETE_OPTS для указания действий по умолчанию. Если не используется ни -c, ни -C CHECK_INSTALLED_OVERLAYS не изменяется. Значение по умолчанию CHECK_INSTALLED_OVERLAYS (рекомендуемое) - \"repository\"; оно работает значительно быстрее, чем CHECK_INSTALLED_OVERLAYS=true, но надежно только для пакетов, установленных с данными о репозитории (это касается всех последних версий portage). Аргумент может быть сокращен; так, вместо "brief" вы можете использовать "b".

source: ... considered as ${z}
ru: ... рассматривается как ${z}

source: No redundant entries in ${rump}{,accept_}keywords
ru: Нет повторяющихся записей в ${rump}{,accept_}keywords

source: Redundant in ${rump}{,accept_}keywords:
ru: Повторяющиеся записи в ${rump}{,accept_}keywords:

source: Skipping check: redundant entries in ${rump}{,accept_}keywords
ru: Проверка пропускается: повторяющиеся записи в ${rump}{,accept_}keywords

source: No uninstalled entries in ${rump}{,accept_}keywords
ru: Нет удаленных записей в ${rump}{,accept_}keywords

source: Not installed but in ${rump}{,accept_}keywords:
ru: Не установлено, но в ${rump}{,accept_}keywords:

source: Skipping check: uninstalled entries in ${rump}{,accept_}keywords
ru: Проверка пропускается: удаленные записи в ${rump}{,accept_}keywords

source: No redundant entries in ${rump}mask
ru: Нет повторяющихся записей в ${rump}mask

source: Redundant in ${rump}mask:
ru: Повторяющиеся записи в ${rump}mask:

source: Skipping check: redundant entries in ${rump}mask
ru: Проверка пропускается: повторяющиеся записи в ${rump}mask

source: No uninstalled entries in ${rump}mask
ru: Нет удаленных записей в ${rump}mask

source: Not installed but in ${rump}mask:
ru: Не установлено, но в ${rump}mask:

source: Skipping check: uninstalled entries in ${rump}mask
ru: Проверка пропускается: удаленные записи в ${rump}mask

source: No redundant entries in ${rump}unmask
ru: Нет повторяющихся записей в ${rump}unmask

source: Redundant in ${rump}unmask:
ru: Повторяющиеся записи в ${rump}unmask:

source: Skipping check: redundant entries in ${rump}unmask
ru: Проверка пропускается: повторяющиеся записи в ${rump}unmask

source: No uninstalled entries in ${rump}unmask
ru: Нет удаленных записей в ${rump}unmask

source: Not installed but in ${rump}unmask:
ru: Не установлен, но в ${rump}unmask:

source: Skipping check: uninstalled entries in ${rump}unmask
ru: Проверка пропускается: удаленные записи в ${rump}unmask

source: No redundant entries in ${rump}use
ru: Нет повторяющихся записей в ${rump}use

source: Redundant in ${rump}use:
ru: Повторяющиеся записи в ${rump}use:

source: Skipping check: redundant entries in ${rump}use
ru: Проверка пропускается: повторяющиеся записи в ${rump}use

source: No uninstalled entries in ${rump}use
ru: Нет удаленных записей в ${rump}use

source: Not installed but in ${rump}use:
ru: Не установлено, но в ${rump}use:

source: Skipping check: uninstalled entries in ${rump}use
ru: Проверка пропускается: удаленные записи в ${rump}use

source: No redundant entries in ${rump}env
ru: Нет повторяющихся записей в ${rump}env

source: Redundant in ${rump}env:
ru: Повторяющиеся записи в ${rump}env:

source: Skipping check: redundant entries in ${rump}env
ru: Проверка пропускается: повторяющиеся записи в ${rump}env

source: No uninstalled entries in ${rump}env
ru: Нет удаленных записей в ${rump}env

source: Not installed but in ${rump}env:
ru: Не установлено, но в ${rump}env:

source: Skipping check: uninstalled entries in ${rump}env
ru: Проверка пропускается: удаленные записи в ${rump}env

source: No redundant entries in ${rump}license
ru: Нет повторяющихся записей в ${rump}license

source: Redundant in ${rump}license:
ru: Повторяющиеся записи в ${rump}license:

source: Skipping check: redundant entries in ${rump}license
ru: Проверка пропускается: повторяющиеся записи в ${rump}license

source: No uninstalled entries in ${rump}license
ru: Нет удаленных записей в ${rump}license

source: Not installed but in ${rump}license:
ru: Не установлено, но в ${rump}license:

source: Skipping check: uninstalled entries in ${rump}license
ru: Проверка пропускается: удаленные записи в ${rump}license

source: No redundant entries in ${rump}cflags
ru: Нет повторяющихся записей в ${rump}cflags

source: Redundant in ${rump}cflags:
ru: Повторяющиеся записи в ${rump}cflags:

source: Skipping check: redundant entries in ${rump}cflags
ru: Проверка пропускается: повторяющиеся записи в ${rump}cflags

source: No uninstalled entries in ${rump}cflags
ru: Нет удаленных записей в ${rump}cflags

source: Not installed but in ${rump}cflags:
ru: Не установлено, но в ${rump}cflags:

source: Skipping check: uninstalled entries in ${rump}cflags
ru: Проверка пропускается: удаленные записи в ${rump}cflags

source: All installed versions of packages are in the database.
ru: Все установленные версии пакетов находятся в базе данных.

source: Installed packages with a version not in the database (or masked):
ru: Версии установленных пакетов не содержатся в базе данных (или замаскированы):

source: Skipping check: installed but not in the database
ru: Проверка пропускается: установлен, но не в базе данных
