Repository: gentoo-mirror/calculate
Catalog: app-portage/eix/files/*.po
Languages: ru

source: This variable is only used for delayed substitution in *FORMAT_* strings. It is used at the end of a package to output a newline unless NEWLINE=true.
ru: Эта переменная используется только для отложенной подстановки в строках *FORMAT_*. Она используется в конце пакета для вывода новой строки, если только не установлена переменная NEWLINE=true.

source: This variable is only used for delayed substitution in *FORMAT_* strings. It defines the format for the printing the package name.
ru: Эта переменная используется только для отложенной подстановки в строках *FORMAT_*. Она определяет формат вывода имени пакета.

source: This variable is only used for delayed substitution in *FORMAT_* strings. It defines the format for the normal header symbols.
ru: Эта переменная используется только для отложенной подстановки в строках *FORMAT_*. Она определяет формат стандартного вывода символов заголовков.

source: This variable is only used for delayed substitution in *FORMAT_* strings. It defines the format for the verbose header symbols.
ru: Эта переменная используется только для отложенной подстановки в строках *FORMAT_*. Она определяет формат подробного вывода символов заголовков.

source: This variable is only used for delayed substitution in *FORMAT_* strings. It defines the format for the compact header symbols.
ru: Эта переменная используется только для отложенной подстановки в строках *FORMAT_*. Она определяет формат компактного вывода символов заголовков.

source: This variable is only used for delayed substitution in *FORMAT_* strings. It defines the format for the diff-new header symbols.
ru: Эта переменная используется только для отложенной подстановки в строках *FORMAT_*. Она определяет формат символов заголовков diff-new.

source: This variable is only used for delayed substitution in *FORMAT_* strings. It defines the format for the diff-delete header symbols.
ru: Эта переменная используется только для отложенной подстановки в строках *FORMAT_*. Она определяет формат символов заголовков diff-delete.

source: This variable is only used for delayed substitution in *FORMAT_* strings. It defines the format for the diff-changed header symbols.
ru: Эта переменная используется только для отложенной подстановки в строках *FORMAT_*. Она определяет формат символов заголовков diff-changed.

source: This variable is only used for delayed substitution in *FORMAT_* strings. If true, compact format prints no version if none is installable.
ru: Эта переменная используется только для отложенной подстановки в строках *FORMAT_*. Когда она имеет значение true, компактный формат вывода не включает версию, если нет версии, доступной для установки.

source: This variable is only used for delayed substitution in *FORMAT_* strings. If true, compact format prints no versions if all installable vanished.
ru: Эта переменная используется только для отложенной подстановки в строках *FORMAT_*. Когда она имеет значение true, компактный формат вывода не включает версию, если все версии, доступные для установки, отсутствуют.

source: This variable is only used for delayed substitution in *FORMAT_* strings. If true, eix-diff prints no version if none is installable.
ru: Эта переменная используется только для отложенной подстановки в строках *FORMAT_*. Если она имеет значение true, eix-diff не выводит версии, если нет версий, доступных для установки.

source: This variable is only used for delayed substitution in *FORMAT_* strings. If true, eix-diff prints no versions if all installable vanished.
ru: Эта переменная используется только для отложенной подстановки в строках *FORMAT_*. Когда она имеет значение true, eix-diff не выводит версии, если все версии, доступные для установки, отсутствуют.

source: This variable is only used for delayed substitution in *FORMAT_* strings. It defines what to print if no version number is printed.
ru: Эта переменная используется только для отложенной подстановки в строках *FORMAT_*. Она определяет, что выводить в том случае, когда не выводится номер версии.

source: This variable is only used for delayed substitution in *FORMAT_* strings. It defines what to print after "->" if there is no installable.
ru: Эта переменная используется только для отложенной подстановки в строках *FORMAT_*. Она определяет, что выводить после "->" в том, случае, если нет пакетов, доступных для установки.

source: This variable is only used for delayed substitution in *FORMAT_* strings. It defines the compact format for the best version(s).
ru: Эта переменная используется только для отложенной подстановки в строках *FORMAT_*. Она определяет компактный формат вывода лучшей версии (версий).

source: This variable is only used for delayed substitution in *FORMAT_* strings. It defines the compact format for the best version(s) in case of changes.
ru: Эта переменная используется только для отложенной подстановки в строках *FORMAT_*. Она определяет компактный формат вывода лучшей версии (версий) в случае, если были внесены изменения.

source: This variable is only used for delayed substitution in *FORMAT_* strings. It defines the eix-diff format for the best version(s).
ru: Эта переменная используется только для отложенной подстановки в строках *FORMAT_*. Она определяет формат вывода eix-diff лучшей версии (версий).

source: This variable is only used for delayed substitution in *FORMAT_* strings. It defines the eix-diff format for the best version(s) in case of changes.
ru: Эта переменная используется только для отложенной подстановки в строках *FORMAT_*. Она определяет формат вывода eix-diff лучшей версии (версий) в случае, если были внесены изменения.

source: This variable is only used for delayed substitution in *FORMAT_* strings. It defines the eix-diff format for the old best versions in case of changes.
ru: Эта переменная используется только для отложенной подстановки в строках *FORMAT_*. Она определяет формат вывода eix-diff лучшей ранней версии в случае, если были внесены изменения.

source: This variable is only used for delayed substitution in *FORMAT_* strings. It defines the eix-diff format for changed versions.
ru: Эта переменная используется только для отложенной подстановки в строках *FORMAT_*. Она определяет формат вывода eix-diff измененных версий.

source: This variable is only used for delayed substitution in *FORMAT_* strings. It defines the format for the printing the optional overlay key.
ru: Эта переменная используется только для отложенной подстановки в строках *FORMAT_*. Она определяет формат вывода необязательного ключа оверлея.

source: This variable is only used for delayed substitution in *FORMAT_* strings. It defines the format for the normal header line.
ru: Эта переменная используется только для отложенной подстановки в строках *FORMAT_*. Она определяет формат стандартного вывода строки заголовка.

source: This variable is only used for delayed substitution in *FORMAT_* strings. It defines the format for the verbose header line.
ru: Эта переменная используется только для отложенной подстановки в строках *FORMAT_*. Она определяет формат подробного вывода строки заголовка.

source: This variable is only used for delayed substitution in *FORMAT_* strings. It defines the format for the compact header line.
ru: Эта переменная используется только для отложенной подстановки в строках *FORMAT_*. Она определяет формат компактного вывода строки заголовка.

source: This variable is only used for delayed substitution in *FORMAT_* strings. It defines the format for the diff-new header.
ru: Эта переменная используется только для отложенной подстановки в строках *FORMAT_*. Она определяет формат заголовка diff-new.

source: This variable is only used for delayed substitution in *FORMAT_* strings. It defines the format for the diff-delete header.
ru: Эта переменная используется только для отложенной подстановки в строках *FORMAT_*. Она определяет формат заголовка diff-delete.

source: This variable is only used for delayed substitution in *FORMAT_* strings. It defines the format for the diff-changed header.
ru: Эта переменная используется только для отложенной подстановки в строках *FORMAT_*. Она определяет формат заголовка diff-changed.

source: This variable is only used for delayed substitution in *FORMAT_* strings. It defines the format for a line with installed versions.
ru: Эта переменная используется только для отложенной подстановки в строках *FORMAT_*. Она определяет формат строки, содержащей установленные версии.

source: This variable is only used for delayed substitution in *FORMAT_* strings. It defines the eix-diff line for the best versions/slots.
ru: Эта переменная используется только для отложенной подстановки в строках *FORMAT_*. Она определяет формат строки лучших версий/слотов для eix-diff.

source: This variable is only used for delayed substitution in *FORMAT_* strings. It defines the eix-diff line for changed versions.
ru: Эта переменная используется только для отложенной подстановки в строках *FORMAT_*. Она определяет формат строки измененных версий для eix-diff.

source: This variable is only used for delayed substitution in *FORMAT_* strings. It defines the format for a line with marked versions.
ru: Эта переменная используется только для отложенной подстановки в строках *FORMAT_*. Она определяет формат строки, содержащей маркированные версии.

source: This variable is only used for delayed substitution in *FORMAT_* strings. It defines whether to include "system" in package sets output.
ru: Эта переменная используется только для отложенной подстановки в строках *FORMAT_*. Она определяет , включать ли сет "system" в вывод сетов пакетов.

source: This variable is only used for delayed substitution in *FORMAT_* strings. It is the command used to print the package set names.
ru: Эта переменная используется только для отложенной подстановки в строках *FORMAT_*. Эта команда используется для вывода имен сетов пакетов.

source: This variable is only used for delayed substitution in *FORMAT_* strings. It defines the format for a line with package sets.
ru: Эта переменная используется только для отложенной подстановки в строках *FORMAT_*. Она определяет формат строки, содержащей сеты пакетов.

source: This variable is only used for delayed substitution in *FORMAT_* strings. It defines the format for a line with the package homepage.
ru: Эта переменная используется только для отложенной подстановки в строках *FORMAT_*. Она определяет формат строки, содержащей домашнюю страницу пакета.

source: This variable is only used for delayed substitution in *FORMAT_* strings. It defines the format for a line with the package bug-reference.
ru: Эта переменная используется только для отложенной подстановки в строках *FORMAT_*. Она определяет формат строки, содержащей ссылку на баг-трекер пакета.

source: This variable is only used for delayed substitution in *FORMAT_* strings. It defines the format for a line with the package description.
ru: Эта переменная используется только для отложенной подстановки в строках *FORMAT_*. Она определяет формат строки, содержащей описание пакета.

source: This variable is only used for delayed substitution in *FORMAT_* strings. It defines the format for a line with the best versions/slots.
ru: Эта переменная используется только для отложенной подстановки в строках *FORMAT_*. Она определяет формат строки, содержащей лучшие версии/слоты.

source: This variable is only used for delayed substitution in *FORMAT_* strings. It defines the format for a line with the up-/downgrade recommendations.
ru: Эта переменная используется только для отложенной подстановки в строках *FORMAT_*. Она определяет формат строки, содержащей рекомендации по обновлению/откату.

source: This variable is only used for delayed substitution in *FORMAT_* strings. It defines the format for a line with the package provides.
ru: Эта переменная используется только для отложенной подстановки в строках *FORMAT_*. Она определяет формат строки, содержащей источники данных.

source: This variable is only used for delayed substitution in *FORMAT_* strings. It defines the format for a line with the package licenses.
ru: Эта переменная используется только для отложенной подстановки в строках *FORMAT_*. Она определяет формат строки, содержащей лицензии пакета.

source: This variable is only used for delayed substitution in *FORMAT_* strings. It defines the format for eix-diff after the versions.
ru: Эта переменная используется только для отложенной подстановки в строках *FORMAT_*. Она определяет формат вывода eix-diff после версий.

source: This format is only used for delayed substitution in FORMAT. It defines the format of the normal output of eix.
ru: Этот формат используется только для отложенной подстановки в FORMAT. Она определяет формат стандартного вывода eix.

source: This format is only used for delayed substitution in FORMAT_COMPACT. It defines the format of the compact output of eix (option -c).
ru: Этот формат используется только для отложенной подстановки в FORMAT_COMPACT. Она определяет формат компактного вывода eix (опция -c).

source: This format is only used for delayed substitution in FORMAT_VERBOSE. It defines the format of the verbose output of eix (option -v).
ru: Этот формат используется только для отложенной подстановки в FORMAT_VERBOSE. Она определяет формат подробного вывода eix (опция -v).

source: The format of the normal output of eix. Do not modify it in a config file; modify FORMAT_ALL instead.
ru: Формат стандартного вывода eix. Не пытайтесь изменить его через конфигурационный файл; редактируйте напрямую FORMAT_ALL.

source: The format of the compact output of eix (option -c). Do not modify it in a config file; modify FORMAT_ALL_COMPACT instead.
ru: Формат компактного вывода eix (опция -c). Не пытайтесь изменить его через конфигурационный файл; редактируйте напрямую FORMAT_ALL_COMPACT.

source: The format of the verbose output of eix (option -v). Do not modify it in a config file; modify FORMAT_ALL_VERBOSE instead.
ru: Формат подробного вывода eix (опция -v). Не пытайтесь изменить его через конфигурационный файл; редактируйте напрямую FORMAT_ALL_VERBOSE.

source: This format is only used for delayed substitution in DIFF_FORMAT_NEW. It defines the format used for new packages (eix-diff).
ru: Этот формат используется только для отложенной подстановки в DIFF_FORMAT_NEW. Она определяет формат для новых пакетов (eix-diff).

source: This format is only used for delayed substitution in DIFF_FORMAT_DELETE. It defines the format used for packages that were deleted (eix-diff).
ru: Этот формат используется только для отложенной подстановки в DIFF_FORMAT_DELETE. Она определяет формат для пакетов, которые были удалены (eix-diff).

source: This format is only used for delayed substitution in DIFF_FORMAT_CHANGED. It defines the format used for packages that were changed (eix-diff).
ru: Этот формат используется только для отложенной подстановки в DIFF_FORMAT_CHANGED. Она определяет формат для пакетов, которые были изменены (eix-diff).

source: The format used for new packages (eix-diff). Do not modify it in a config file; modify DIFF_FORMAT_ALL_NEW instead.
ru: Этот формат используется для новых пакетов (eix-diff). Не пытайтесь изменить его через конфигурационный файл; редактируйте напрямую DIFF_FORMAT_ALL_NEW.

source: The format used for packages that were deleted (eix-diff). Do not modify it in a config file; modify DIFF_FORMAT_ALL_DELETE instead.
ru: Этот формат используется для удаленных пакетов (eix-diff). Не пытайтесь изменить его через конфигурационный файл; редактируйте напрямую DIFF_FORMAT_ALL_DELETE.

source: The format used for packages that were changed (eix-diff). Do not modify it in a config file; modify DIFF_FORMAT_ALL_CHANGED instead.
ru: Этот формат используется для измененных пакетов (eix-diff). Не пытайтесь изменить его через конфигурационный файл; редактируйте напрямую DIFF_FORMAT_ALL_CHANGED.

source: strftime() format for printing the installation date in long form
ru: формат strftime() для вывода даты установки в полном виде

source: strftime() format for printing the installation date in short form
ru: формат strftime() для вывода даты установки в кратком виде

source: This string is printed before KEYWORDS string for a version is output. (Normally, this is only used when --versionlines is active)
ru: Эта строка выводится перед выводом строки KEYWORDS для данной версии. (Обычно это имеет смысл только в том случае, если действует ключ --versionlines)

source: This string is printed after KEYWORDS string for a version is output. (Normally, this is only used when --versionlines is active)
ru: Эта строка выводится после вывода строки KEYWORDS для данной версии. (Обычно это имеет смысл только в том случае, если действует ключ --versionlines)

source: This variable is only used for delayed substitution. If true, print KEYWORDS for each version with --versionlines.
ru: Эта переменная используется только для отложенной подстановки. Если она имеет значение true, для каждой версии с --versionlines будут выводиться KEYWORDS.

source: Print effective keywords if the profile modified those of the ebuild. This is only used if PRINT_KEYWORDS gets active.
ru: Выводит активные ключевые слова, если профиль изменил ключевые слова ебилда. Это имеет смысл только в том случае, если действует PRINT_KEYWORDS.

source: If PRINT_EFFECTIVE_KEYWORDS applies this string is printed after the keywords and before the effective keywords string. (Normally, this is only used when --versionlines is active)
ru: Если применяется PRINT_EFFECTIVE_KEYWORDS, данная строка выводится после ключевых слов, перед строкой действующих ключевых слов. (Как правило, используется только с опцией --versionlines)

source: This string is printed after the effective keywords (if these are printed). (Normally, this is only used when --versionlines is active)
ru: Эта строка выводится после действующих ключевых слов (если они выведены). (Как правило, используется только с опцией --versionlines)

source: Can be full/effective/both/full*/effective*/none. Depending on the value, with --xml the full/effective (or both types) KEYWORDS string is output for each version. With full*/effective* also both types are output if they differ.
ru: Может быть full/effective/both/full*/effective*/none. В зависимости от значения, при опции --xml для каждой версии выводится строка KEYWORDS full/effective (или обе). При full*/effective* также выводятся оба типа, если они различаются.

source: If false, the overlay is not output with --xml. For overlays without label (repository name) the overlay is output anyway.
ru: Если значение false, оверлей не будет выводится с опцией --xml. В случае оверлеев без метки (имени репозитория), оверлей всё равно будет выведен.

source: strftime() format for printing the installation date with --xml.
ru: формат strftime() для вывода даты установки при выставленной опции --xml.

source: This string is printed before each set USE flag of an installed version.
ru: Эта строка выводится перед каждым активным USE-флагом установленной версии.

source: This string is printed after each set USE flag of an installed version.
ru: Эта строка выводится после каждого активного USE-флага установленной версии.

source: This string is printed before each unset USE flag of an installed version.
ru: Эта строка выводится перед каждым отключенным USE-флагом установленной версии.

source: This string is printed after each unset USE flag of an installed version.
ru: Эта строка выводится после каждого отключенного USE-флага установленной версии.

source: This variable is only used for delayed substitution. This string is printed after IUSE data for a version is output. (Normally, this is only used when --versionlines is active)
ru: Эта переменная используется только для отложенной подстановки. Эта строка выводится после IUSE-данных версии. (Как правило, используется только с опцией --versionlines)

source: This variable is only used for delayed substitution. This string is printed before IUSE data for a version is output. (Normally, this is only used when --versionlines is active)
ru: Эта переменная используется только для отложенной подстановки. Эта строка выводится перед IUSE-данными версии. (Как правило, используется только с опцией --versionlines)

source: This variable is only used for delayed substitution. This string is printed before IUSE data for all versions is output. (This is only used when --versionlines is inactive and there are no slots)
ru: Эта переменная используется только для отложенной подстановки. Эта строка выводится перед IUSE-данными всех версий. (Применяется только тогда, когда не используется опция --versionlines и нет слотов.)

source: This variable is only used for delayed substitution. This string is printed after IUSE data for all versions is output. (This is only used when --versionlines is inactive and there are no slots)
ru: Эта переменная используется только для отложенной подстановки. Эта строка выводится после IUSE-данных всех версий. (Применяется только тогда, когда не используется опция --versionlines и нет слотов.)

source: This variable is only used for delayed substitution. This string is printed before IUSE data for all versions is output. (This is only used when --versionlines is inactive and there are slots)
ru: Эта переменная используется только для отложенной подстановки. Эта строка выводится перед IUSE-данными всех версий. (Применяется только тогда, когда не используется опция --versionlines и нет слотов.)

source: This variable is only used for delayed substitution. This string is printed after IUSE data for all versions is output. (This is only used when --versionlines is inactive and there are slots)
ru: Эта переменная используется только для отложенной подстановки. Эта строка выводится после IUSE-данных всех версий. (Применяется только тогда, когда не используется опция --versionlines и нет слотов.)

source: This variable is only used for delayed substitution. It defines the color for masked versions.
ru: Эта переменная используется только для отложенной подстановки. Она определяет цвет вывода замаскированных версий.

source: This variable is only used for delayed substitution. It defines the color for unstable versions.
ru: Эта переменная используется только для отложенной подстановки. Она определяет цвет для вывода нестабильных версий.

source: This variable is only used for delayed substitution. It defines the color for stable versions.
ru: Эта переменная используется только для отложенной подстановки. Она определяет цвет для вывода стабильных версий.

source: This variable is only used for delayed substitution. It defines the format to change the color for masked versions.
ru: Эта переменная используется только для отложенной подстановки. Она определяет формат изменения цвета для замаскированных версий.

source: This variable is only used for delayed substitution. It defines the format to change the color for unstable versions.
ru: Эта переменная используется только для отложенной подстановки. Она определяет формат изменения цвета для нестабильных версий.

source: This variable is only used for delayed substitution. It defines the format to change the color for stable versions.
ru: Эта переменная используется только для отложенной подстановки. Она определяет формат изменения цвета для стабильных версий.

source: Color for the overlaykey in version listings.
ru: Цвет ключа оверлея в списках версий.

source: Color for the overlaykey for virtual overlays in version listings.
ru: Цвет ключа виртуального оверлея в списках версий.

source: Color for slots. This is only used for delayed substitution.
ru: Цвет для вывода слотов. Используется только для отложенной подстановки.
