Repository: gentoo-mirror/calculate
Catalog: app-portage/eix/files/*.po
Languages: ru

source: This variable is only used for delayed substitution. It defines the color used for printing the set useflags.
ru: Эта переменная используется только для отложенной подстановки. Она определяет цвет для вывода активных USE-флагов.

source: This variable is only used for delayed substitution. It defines the color used for printing the unset useflags.
ru: Эта переменная используется только для отложенной подстановки. Она определяет цвет для вывода отключенных USE-флагов.

source: This variable is only used for delayed substitution. It defines the color used for printing the version of installed packages.
ru: Эта переменная используется только для отложенной подстановки. Она определяет цвет для вывода версий установленных пакетов.

source: This variable is only used for delayed substitution. It defines the color used for the title texts for installed versions.
ru: Эта переменная используется только для отложенной подстановки. Она определяет цвет для вывода заголовочных текстов для установленных версий.

source: This variable is only used for delayed substitution. It defines the color used for printing a marked version of a packages.
ru: Эта переменная используется только для отложенной подстановки. Она определяет цвет для вывода помеченных версий пакетов.

source: This variable is only used for delayed substitution. It defines the color used for printing the package sets.
ru: Эта переменная используется только для отложенной подстановки. Она определяет цвет для вывода сетов пакетов.

source: This variable is only used for delayed substitution. It defines the color used for printing a marked package name.
ru: Эта переменная используется только для отложенной подстановки. Она определяет цвет для вывода имени помеченного пакета.

source: This variable is only used for delayed substitution. It defines the character printed for upgrade recommendations.
ru: Эта переменная используется только для отложенной подстановки. Она определяет символ, выводимый для обозначения рекомендованного обновления пакета.

source: This variable is only used for delayed substitution. It defines the character printed for downgrade recommendations.
ru: Эта переменная используется только для отложенной подстановки. Она определяет символ, выводимый для обозначения рекомендованного отката пакета.

source: This variable is only used for delayed substitution. It defines the character printed for installed packages.
ru: Эта переменная используется только для отложенной подстановки. Она определяет символ, выводимый для обозначения установленного пакета.

source: This variable is only used for delayed substitution. It defines the character printed for uninstalled packages.
ru: Эта переменная используется только для отложенной подстановки. Она определяет символ, выводимый для обозначения удаленного пакета.

source: This variable is only used for delayed substitution. It defines the character printed for uninstalled packages which have gained a stable version.
ru: Эта переменная используется только для отложенной подстановки. Она определяет символ, выводимый для обозначения удаленного пакета, который теперь имеет стабильную версию.

source: This variable is only used for delayed substitution. It defines the character printed for installed packages which have gained a stable version.
ru: Эта переменная используется только для отложенной подстановки. Она определяет символ, выводимый для обозначения установленного пакета, которые теперь имеет стабильную версию.

source: This variable is only used for delayed substitution. It defines the character printed for new packages (eix-diff).
ru: Эта переменная используется только для отложенной подстановки. Она определяет символ, выводимый для обозначения новых пакетов (eix-diff).

source: This variable is only used for delayed substitution. It defines the character used for "better version" tags (eix-diff).
ru: Эта переменная используется только для отложенной подстановки. Она определяет символ, выводимый для обозначения версий, помеченных как лучшие (eix-diff).

source: This variable is only used for delayed substitution. It defines the character used for "worse version" tags (eix-diff).
ru: Эта переменная используется только для отложенной подстановки. Она определяет символ, выводимый для обозначения версий, помеченных как худшие (eix-diff).

source: This variable is only used for delayed substitution. It defines the tag printed for upgrade recommendations.
ru: Эта переменная используется только для отложенной подстановки. Она определяет метку рекомендованных обновлений.

source: This variable is only used for delayed substitution. It defines the tag printed for downgrade recommendations.
ru: Эта переменная используется только для отложенной подстановки. Она определяет метку рекомендованных откатов.

source: This variable is only used for delayed substitution. It defines the tag printed for installed packages.
ru: Эта переменная используется только для отложенной подстановки. Она определяет метку установленных пакетов.

source: This variable is only used for delayed substitution. It defines the tag printed for uninstalled packages.
ru: Эта переменная используется только для отложенной подстановки. Она определяет метку удаленных пакетов.

source: This variable is only used for delayed substitution. It defines the tag for packages which have gained a stable version.
ru: Эта переменная используется только для отложенной подстановки. Она определяет метку пакетов, которые теперь имеют стабильную версию.

source: This variable is only used for delayed substitution. It defines the tag printed for new packages (eix-diff).
ru: Эта переменная используется только для отложенной подстановки. Она определяет метку новых пакетов (eix-diff).

source: This variable is only used for delayed substitution. It defines the tag used for "better version" (eix-diff).
ru: Эта переменная используется только для отложенной подстановки. Она определяет метку лучших версий (eix-diff).

source: This variable is only used for delayed substitution. It defines the tag used for "worse version" (eix-diff).
ru: Эта переменная используется только для отложенной подстановки. Она определяет метку худших версий (eix-diff).

source: This variable is only used for delayed substitution. It defines the string used for "plain" tagging installed packages.
ru: Эта переменная используется только для отложенной подстановки. Она определяет строку, используемую, чтобы пометить установленные пакеты как обычные, "plain".

source: This variable is only used for delayed substitution. It defines the string used for "plain" tagging uninstalled packages.
ru: Эта переменная используется только для отложенной подстановки. Она определяет строку, используемую, чтобы пометить удаленные пакеты как обычные, "plain".

source: This variable is only used for delayed substitution. It defines the string used for "new package" separators (eix-diff).
ru: Эта переменная используется только для отложенной подстановки. Она определяет строку, используемую как разделитель новых пакетов (eix-diff).

source: This variable is only used for delayed substitution. It defines the string used for "deleted package" separators (eix-diff).
ru: Эта переменная используется только для отложенной подстановки. Она определяет строку, используемую как разделитель удаленных пакетов (eix-diff).

source: This variable is only used for delayed substitution. It defines the string used for "changed package" separators (eix-diff).
ru: Эта переменная используется только для отложенной подстановки. Она определяет строку, используемую как разделитель измененных пакетов (eix-diff).

source: This variable is only used for delayed substitution. It sets the runtime variable m to the masking tag, and unless the runtime variable c is set, it outputs the color and sets c.
ru: Эта переменная используется только для отложенной подстановки. Она устанавливает значением переменной исполняемой среды m метку маскировки, и, если только переменная исполняемой среды c не установлена, задает цветной вывод и устанавливает c.

source: This variable is only used for delayed substitution. It sets the runtime variable s to the stability tag, and unless the runtime variable c is set, it outputs the color and sets c.
ru: Эта переменная используется только для отложенной подстановки. Она устанавливает значением переменной исполняемой среды s метку стабильности, и, если только переменная исполняемой среды c не установлена, задает цветной вывод и устанавливает c.

source: This variable is only used for delayed substitution. It outputs the stability tag, changing the color appropriately. It sets the runtime variable c depending on whether color was changed.
ru: Эта переменная используется только для отложенной подстановки. Она выводит метку стабильности и соответственно меняет цвет. При этом переменная исполняемой среды c устанавливается в зависимости от того, изменен ли цвет.

source: This variable is only used for delayed substitution. It outputs the PROPERTIES tag, changing the color appropriately. It sets the runtime variable c if color was changed.
ru: Эта переменная используется только для отложенной подстановки. Она выводит метку PROPERTIES и соответственно меняет цвет. При этом устанавливается переменная исполняемой среды c, если изменился цвет.

source: This variable is only used for delayed substitution. It outputs the RESTRICT tag, changing the color appropriately. It sets the runtime variable c if color was changed.
ru: Эта переменная используется только для отложенной подстановки. Она выводит метку RESTRICT и соответственно меняет цвет. При этом устанавливается переменная исполняемой среды c, если изменился цвет.

source: This variable is only used for delayed substitution. It defines the format of the PROPERTIES and RESTRICT of a version and resets the color.
ru: Эта переменная используется только для отложенной подстановки. Она определяет формат меток PROPERTIES и RESTRICT версии и инициализирует цвет.

source: This variable is only used for delayed substitution. It defines the slot format printed for slotsorted versions.
ru: Эта переменная используется только для отложенной подстановки. Она определяет формат слота для версий, к которым применена опция slotsorted.

source: This variable is used for <markedversions:VERSION>. It just gives the plain version name without anything else. You can use it similarly for e.g. <availableversions:VERSION>.
ru: Эта переменная используется для <markedversions:VERSION>. Она выводит только обычное имя версии, без дополнительных данных. Ее можно использовать аналогично, например, для <availableversions:VERSION>.

source: This variable is only used for delayed substitution. It outputs an available version with various marks and sets the runtime variable c if a mark was printed. It should be follows by FORMAT_VERSION_END or FORMAT_VERSIONS_END.
ru: Эта переменная используется только для отложенной подстановки. Она выводит доступную версию с различными маркерами и, если был выведен маркер, устанавливает переменную исполняемой среды c. Вслед за ней должна идти переменная FORMAT_VERSION_END или FORMAT_VERSIONS_END.

source: This variable is only used for delayed substitution. It resets all colors/markers if the runtime variable c was set.
ru: Эта переменная используется только для отложенной подстановки. Если была установлена переменная исполняемой среды c, она инициализирует все цвета/маркеры.

source: This variable is only used for delayed substitution. It outputs an optional slot, caring about the runtime variable c, and then invokes FORMAT_VERSION_END.
ru: Эта переменная используется только для отложенной подстановки. Она выводит необязательный слот, отвечая за переменную исполняемой среды c, а затем вызывает FORMAT_VERSION_END.

source: This variable is only used for delayed substitution. It defines the format for a plain version without slot.
ru: Эта переменная используется только для отложенной подстановки. Она определяет формат обычной версии без слота.

source: This variable is only used for delayed substitution. It defines the format for printing a plain version with its slot.
ru: Эта переменная используется только для отложенной подстановки. Она определяет формат вывода обычной версии со слотом.

source: This variable is only used for delayed substitution. It defines the format for an available version without slot.
ru: Эта переменная используется только для отложенной подстановки. Она определяет формат доступной версии без слота.

source: This variable is only used for delayed substitution. It defines the format for printing an available version with its slot.
ru: Эта переменная используется только для отложенной подстановки. Она определяет формат вывода доступной версии со слотом.

source: This variable is only used for delayed substitution. It defines the format for printing an installed version with its slot.
ru: Эта переменная используется только для отложенной подстановки. Она определяет формат вывода установленной версии со слотом.

source: This variable is only used for delayed substitution. It defines the format for a plain version with most data and slot.
ru: Эта переменная используется только для отложенной подстановки. Она определяет формат вывода обычной версии с большинством данных и слотом.

source: This variable is only used for delayed substitution. It defines the format for an available version with most data and slot.
ru: Эта переменная используется только для отложенной подстановки. Она определяет формат доступной версии с большинством данных и слотом.

source: This variable is only used for delayed substitution. It defines the format for an installed version with most data and slot.
ru: Эта переменная используется только для отложенной подстановки. Она определяет формат установленной версии с большинством данных и слотом.

source: This variable is only used for delayed substitution. It defines the format for a plain version with most data, no slot.
ru: Эта переменная используется только для отложенной подстановки. Она определяет формат обычной версии с большинством данных, без слота.

source: This variable is only used for delayed substitution. It defines the format for an available version with most data, no slot.
ru: Эта переменная используется только для отложенной подстановки. Она определяет формат доступной версии с большинством данных, без слота.

source: This variable is only used for delayed substitution. It defines the format for a plain version with important data and slot.
ru: Эта переменная используется только для отложенной подстановки. Она определяет формат обычной версии с важными данными и слотом.

source: This variable is only used for delayed substitution. It defines the format for an available version with important data and slot.
ru: Эта переменная используется только для отложенной подстановки. Она определяет формат доступной версии с важными данными и слотом.

source: This variable is only used for delayed substitution. It defines the format for an installed version with important data and slot.
ru: Эта переменная используется только для отложенной подстановки. Она определяет формат установленной версии с важными данными и слотом.

source: This variable is only used for delayed substitution. It defines the format for a plain version with important data, no slot.
ru: Эта переменная используется только для отложенной подстановки. Она определяет формат обычной версии с важными данными, без слота.

source: This variable is only used for delayed substitution. It defines the format for an available version with important data, no slot.
ru: Эта переменная используется только для отложенной подстановки. Она определяет формат доступной версии с важными данными, без слота.

source: This variable is only used for delayed substitution. It defines the format for those data not even included in verbose versions
ru: Эта переменная используется только для отложенной подстановки. Она определяет формат для данных, не включенных даже в подробный вывод.

source: This variable is only used for delayed substitution. It defines the lineskip + slot with lineskip.
ru: Эта переменная используется только для отложенной подстановки. Она определяет пропуск строк + слот с пропуском строки.

source: This variable is only used for delayed substitution. It defines the lineskip + stability for available versions with lineskip.
ru: Эта переменная используется только для отложенной подстановки. Она определяет пропуск строк + стабильность для доступных версий с пропуском строк.

source: This variable is only used for delayed substitution. It defines the lineskip for installed versions.
ru: Эта переменная используется только для отложенной подстановки. Она определяет пропуск строк для установленных версий.

source: This variable is used as a version formatter. It defines the format for a version; versionsorted with versionlines.
ru: Эта переменная используется как разметка версии. Она определяет формат версии; versionsorted с versionlines.

source: This variable is used as a version formatter. It defines the format for a version; versionsorted without versionlines.
ru: Эта переменная используется как разметка версии. Она определяет формат версии; versionsorted без versionlines.

source: This variable is used as a version formatter. It defines the format for a version; slotsorted with versionlines.
ru: Эта переменная используется как разметка версии. Она определяет формат версии; slotsorted с versionlines.

source: This variable is used as a version formatter. It defines the format for a version; slotsorted without versionlines.
ru: Эта переменная используется как разметка версии. Она определяет формат версии; slotsorted без versionlines.

source: This variable is only used for delayed substitution. It defines the format for collected IUSE data.
ru: Эта переменная используется только для отложенной подстановки. Она определяет формат собранных IUSE-данных.

source: This variable is used as a version formatter. It defines the normal format of installed versions.
ru: Эта переменная используется как разметка версии. Она определяет стандартный формат вывода установленных версий.

source: This variable is used as a version formatter. It defines the compact format of installed versions.
ru: Эта переменная используется как разметка версии. Она определяет компактный формат вывода установленных версий.

source: This variable is used as a version formatter. It defines the verbose format of installed versions.
ru: Эта переменная используется как разметка версии. Она определяет подробный формат вывода установленных версий.

source: This variable is used by delayed substitution in version formatters. It prints a newline if it appears appropriate. If the last version might be skipped (by using conditionals in your version formatter) you should set NEWLINE=false since you otherwise get an additional newline after the last actually printed version.
ru: Эта переменная используется для отложенной подстановки в разметках версии. Она выводит новую строку, когда это разумно. Если последнюю версию можно пропустить (используя условные выражения в вашей разметке версии), следует установить значение NEWLINE=false, так как в противном случае вы получите дополнительную новую строку после последней выведенной версии.

source: This variable is used as a version formatter. It is an example for usage with <bestslotupgradeversions:NAMEVERSION> or <installedversions:NAMEVERION> or <availableversions:NAMEVERSION>.
ru: Эта переменная используется как разметка версии. Это пример ее использования с <bestslotupgradeversions:NAMEVERSION>, или <installedversions:NAMEVERSION>, или <availableversions:NAMEVERSION>.

source: This variable is used as a version formatter. It is an example for usage with <bestslotupgradeversions:EQNAMEVERSION> or <installedversions:EQNAMEVERION> or <availableversions:EQNAMEVERSION> .
ru: Эта переменная используется как разметка версии. Это пример ее использования с <bestslotupgradeversions:EQNAMEVERSION>, или <installedversions:EQNAMEVERION> или <availableversions:EQNAMEVERSION> .

source: This variable is used as a version formatter. It is an example for usage as <availableversion:ANAMESLOT:ANAMESLOT>.
ru: Эта переменная используется как разметка версии. Это пример ее использования с <availableversion:ANAMESLOT:ANAMESLOT>.

source: This variable is used as a version formatter. It is an example for usage with <availableversion:ANAMEASLOT:ANAMEASLOT>.
ru: Эта переменная используется как разметка версии. Это пример ее использования с <availableversion:ANAMEASLOT:ANAMEASLOT>.

source: This variable is used as a version formatter. It is an example for usage with <installedversions:NAMESLOT>.
ru: Эта переменная используется как разметка версии. Это пример ее использования с <installedversions:NAMESLOT>.

source: This variable is used as a version formatter. It is an example for usage with <installedversions:NAMEASLOT>.
ru: Эта переменная используется как разметка версии. Это пример ее использования с <installedversions:NAMEASLOT>.

source: strftime() format for printing the installation date in DATESORT
ru: формат strftime() для отображения даты установки в DATESORT

source: This variable is used as a version formatter. It is an example for usage as <installedversions:DATESORT>. Typical usage: eix -'*I' --format '<installedversions:DATESORT>' | sort | cut -f2-3
ru: Эта переменная используется как разметка версии. Она может быть использована, например, с <installedversions:DATESORT>. Обычный синтаксис: eix -'*I' --format '<installedversions:DATESORT>' | sort | cut -f2-3

source: This variable is only used for delayed substitution. It defines the verbose format for printing available versions.
ru: Эта переменная используется только для отложенной подстановки. Она определяет подробный формат вывода доступных версий.

source: This variable is only used for delayed substitution. It defines the format for useflags in installed versions.
ru: Эта переменная используется только для отложенной подстановки. Она определяет формат USE-флагов в установленных версиях.

source: This variable is only used for delayed substitution. It defines the format used for printing installed versions normally.
ru: Эта переменная используется только для отложенной подстановки. Она определяет формат, используемый для стандартного вывода установленных версий.

source: This variable is only used for delayed substitution. It defines the format used for printing installed versions compactly.
ru: Эта переменная используется только для отложенной подстановки. Она определяет формат, используемый для компактного вывода установленных версий.

source: This variable is only used for delayed substitution. It defines the format used for printing installed versions verbosely.
ru: Эта переменная используется только для отложенной подстановки. Она определяет формат, используемый для подробного вывода установленных версий.

source: This variable is only used for delayed substitution in *FORMAT_* strings. It defines the "normal" format for a line with installed versions.
ru: Эта переменная используется только для отложенной подстановки в строках *FORMAT_*. Она определяет стандартный формат строки, содержащей установленные версии.

source: This variable is only used for delayed substitution in *FORMAT_* strings. It defines the verbose format for a line with installed versions.
ru: Эта переменная используется только для отложенной подстановки в *FORMAT_* strings. Она определяет подробный формат строки, содержащей установленные версии.

source: This variable is only used for delayed substitution in *FORMAT_* strings. It defines the format for eix-diff for installed versions.
ru: Эта переменная используется только для отложенной подстановки в строках *FORMAT_*. Она определяет формат вывода eix-diff установленных версий.
