Repository: gentoo-mirror/calculate
Catalog: app-portage/eix/files/*.po
Languages: ru

source: error while reading from database
ru: ошибка при считывании базы данных

source: error while writing to database
ru: ошибка при записи в базу данных

source: Illegal marker name %r
ru: Недопустимое имя маркера %r

source: Invalid brightness value %r
ru: Неверное значение для уровня яркости %r

source: Illegal color name %r
ru: Недопустимое имя цвета %r

source: Unknown option --%s
ru: Неизвестная опция --%s

source: Unknown option -%c
ru: Неизвестная опция -%c

source: Missing parameter to --%s
ru: Отсутствует параметр --%s

source: Missing second parameter to --%s
ru: Отсутствует второй параметр --%s

source: -- Invalid line %s in %s: %r
ru: -- Неверная строка %s в %s: %r

source: format specifier missing
ru: отсутствует спецификатор формата

source: unknown format specifier '%%%s'
ru: неизвестный спецификатор формата '%%%s'

source: flags should not start with a '+': %s
ru: флаги не должны начинаться с '+': %s

source: Internal error: Storing required after finalizing
ru: Внутренняя ошибка: запись вызвана после завершения.

source: Internal error: Hashing required after finalizing
ru: Внутренняя ошибка: хеширование вызвано после завершения.

source: Internal error: Hashing required in non-hash mode
ru: Внутренняя ошибка: хеширование вызвано в режиме без хеша.

source: Internal error: Index required before sorting.
ru: Внутренняя ошибка: индекс запрошен до сортировки.

source: Internal error: Trying to shortcut non-hashed string.
ru: Внутренняя ошибка: попытка создать ссылку на нехешированную строку.

source: Database corrupt: Nonexistent hash required
ru: База данных повреждена: требуется несуществующий хеш.

source: getpwuid() tells me that my effective uid is not known to this system.
ru: getpwuid() сообщает, что мой реальный uid неизвестен этой системе

source: getgrnam(%r) failed: %s
ru: Ошибка getgrnam(%r): %s

source: Nesting level too deep in %r
ru: Слишком низкий уровень вложения в %r

source: failed to source %r
ru: не удалось определить путь %r

source: Can't map file %r
ru: Невозможно преобразовать файл %r

source: Nesting level too deep when reading %r
ru: Слишком низкий уровень вложения при чтении %r

source: The file which is used instead of /etc/eixrc and ~/.eixrc. This variable can of course only be set in the environment.
ru: Файл, который используется вместо /etc/eixrc и ~/.eixrc. Разумеется, эта переменная может быть определена только в окружении.

source: This path is prepended to source commands in /etc/eixrc. If set in /etc/eixrc it temporarily overrides the environment. You must not use delayed substitution in this variable.
ru: Этот путь ставится в начале команд указания пути в /etc/eixrc. Значение, установленное в /etc/eixrc, временно переопределяет настройки окружения. Вы не должны применять отложенную подстановку в этой переменной.

source: This variable is used for delayed substitution in EIX_SYNC_CONF. It contains code which is evaluated by eix-sync, so be aware of security!
ru: Эта переменная используется для отложенной подстановки в EIX_SYNC_CONF. Она содержит код, который анализируется eix-sync, поэтому учитывайте соображения безопасности!

source: The content of this variable is appended to /etc/eix-sync.conf In particular, it can be used to override options set in that file. Parts of this variable are evaluated in eix-sync: Be aware of security!
ru: Содержимое этой переменной добавляется в /etc/eix-sync.conf В частности, ее можно использовать для переопределения опций, указанных в этом файле. Переменная частично анализируется eix-sync: учитывайте соображения безопасности!

source: This variable contains default options for the eix-remote script. Note that its content is evaluated, so quote correctly. Typical example: EIX_REMOTE_OPTS='-f "`portageq portdir`/local/layman/eix-caches.tar.bz2"'
ru: Эта переменная содержит опции по умолчанию для скрипта eix-remote. Заметьте, что ее содержимое анализируется, поэтому будьте внимательны, расставляя кавычки. Типичный пример: EIX_REMOTE_OPTS='-f "`portageq portdir`/local/layman/eix-caches.tar.bz2"'

source: This variable contains default options for the eix-layman script. Note that its content is evaluated, so quote correctly.
ru: Эта переменная содержит опции по умолчанию для скрипта eix-layman. Заметьте, что ее содержимое анализируется, поэтому будьте внимательны, расставляя кавычки.

source: This variable contains default options for the eix-test-obsolete script.
ru: Эта переменная содержит опции по умолчанию для скрипта eix-test-obsolete.

source: If this variable is set in the environment, then it is prefixed to the path where /etc/eixrc is searched. If it is not set in the environment, then PORTAGE_CONFIGROOT is used instead. If both are unset, the EIX_PREFIX default value is used instead. Moreover, EIX_PREFIX is used for delayed substitution for EPREFIX and EPREFIX_SOURCE.
ru: Если эта переменная определена в окружении, ее значение становится префиксом пути, по которому ищется /etc/eixrc. Если она не определена в окружении, вместо нее используется PORTAGE_CONFIGROOT. Если обе переменные не определены, используется значение по умолчанию EIX_PREFIX. Кроме того, EIX_PREFIX применяется для отложенной подстановки EPREFIX и EPREFIX_SOURCE.

source: This variable is only used for delayed substitution. It influences most paths except for $HOME/.eixrc, the cache file passed in the command line, PORTAGE_PROFILE, PORTDIR, and overlays. In contrast to EPREFIX, further exceptions are: PORTAGE_CONFIGROOT, portage/scripts-internal stuff and the eix cachefile.
ru: Эта переменная используется только для отложенной подстановки. Она влияет на большинство путей, за исключением $HOME/.eixrc, кэш-файла, заданного в командной строке, PORTAGE_PROFILE, PORTDIR и оверлеев. В отличие от EPREFIX, исключение составляют: PORTAGE_CONFIGROOT, portage/скрипты-содержимое каталогов и кэш-файл eix.

source: This variable is used for delayed substitution for path prefixes. It influences most paths except for $HOME/.eixrc, the cache file passed in the command line, PORTAGE_PROFILE, PORTDIR, and overlays.
ru: Эта переменная используется для отложенной подстановки в качестве префикса пути. Она влияет на большинство путей, в отличие от HOME/.eixrc, кэш-файла, заданного в командной строке, PORTAGE_PROFILE, PORTDIR и оверлеев.

source: This variable is only used for delayed substitution. It is the path prepended to PORTAGE_PROFILE, PORTDIR, and overlays.
ru: Эта переменная используется только для отложенной подстановки. Ее значение применяется в качестве префикса PORTAGE_PROFILE, PORTDIR и оверлеев.

source: It applies for those paths for which EPREFIX and ROOT should both apply. So you can decide here what to do if both are nonempty. For instance, the choice %{EPREFIX}%{ROOT} will apply both; the default applies EPREFIX but not ROOT for these paths in such a case (i.e. if both are nonempty).
ru: Она применяется к тем путям, к которым должны применяться как EPREFIX, так и ROOT. Таким образом, вы можете решать, как поступить, если обе переменные не пустые. Например, выбор %{EPREFIX}%{ROOT} означает применение обеих переменных; по умолчанию для этих путей в этом случае (т.е. если обе переменные не пусты) применяется EPREFIX, но не ROOT.

source: This path is prepended to the /etc paths.
ru: Этот путь применяется как префикс к путям /etc.

source: This file is used instead of %{PORTAGE_CONFIGROOT}/etc/make.globals if it exists. This is reasonable for >=portage-2.2*
ru: Этот файл используется вместо %{PORTAGE_CONFIGROOT}/etc/make.globals, если он существует. Это имеет смысл для версии portage не ниже 2.2*

source: This variable is only used for delayed substitution. It is used as prefix in the EXEC_EBUILD* and EBUILD_DEPEND_TEMP defaults.
ru: Эта переменная используется только для отложенной подстановки. Она применяется в качестве префикса к значениям по умолчанию EXEC_EBUILD* и EBUILD_DEPEND_TEMP.

source: This path is prepended to source commands in /etc/make.{conf,globals}.
ru: Этот путь применяется в качестве префикса к командам назначения пути в /etc/make.{conf,globals}.

source: Prefix to the path where eix expects information about installed packages.
ru: Префикс к пути, по которому eix ожидает информацию об установленных пакетах.

source: This prefix is prepended to the portage cache.
ru: Этот префикс применяется к кэшу portage.

source: This prefix is prepended to overlays when their files are accessed.
ru: Этот префикс применяется к оверлеям при доступе к их файлам.

source: This path is prepended to PORTDIR.
ru: Этот путь используется как префикс к PORTDIR.

source: This path is prepended to PORTIDIR_OVERLAY values.
ru: Этот путь используется как префикс к значениям PORTIDIR_OVERLAY.

source: This path is prepended to PORTAGE_PROFILE.
ru: Этот путь используется как префикс к PORTAGE_PROFILE.

source: This is prepended to overlays in eix database to test whether they exist.
ru: Это значение используется как префикс к оверлеям в базе данных eix, для проверки их существования.

source: This file is the default eix cache.
ru: Этот файл представляет собой кэш eix по умолчанию.

source: The path to the ebuild executable.
ru: Путь к исполняемому файлу ebuild.

source: The path to the ebuild.sh executable.
ru: Путь к исполняемому файлу ebuild.sh.

source: The path to the tempfile generated by "ebuild depend".
ru: Путь к временному файлу, сгенерированному ebuild depend.

source: This file is considered as the world file.
ru: Этот файл считается world-файлом.

source: This file is considered as the world_sets file.
ru: Этот файл считается файлом world_sets.

source: Store the information of the world file in the cache file. Set this to false if you do not want that everybody can get this information.
ru: Хранить информацию из world-файла в файле кэша. Установите значение этой переменной равным false, если вы не хотите делать эту информацию доступной для всех.

source: Prefer the current world file (if readable) over the data in the cachefile.
ru: Предпочитать текущий world-файл (если он доступен для чтения) данным кэш-файла.

source: The root user id number which is used for ad hoc sanity checks.
ru: id пользователя root, который используется для специального санитарного тестирования.

source: Whether to test for group and permissions. You must set this to true if you use more sophisticated permission setups (e.g. NSS/LDAP).
ru: Указывает, проводить ли проверку групп и прав привилегий. Установите значение этой переменной на true, если вы используете более сложную настройку доступа (например, NSS/LDAP).

source: The user which is used for running bash on ebuilds when cache method ebuild or ebuild* is used. See EBUILD_UID.
ru: Пользователь, от имени которого запускается bash для обработки ебилдов при использовании метода кэширования ebuild или ebuild*. См. EBUILD_UID.

source: The group which is used for running bash on ebuilds when cache method ebuild or ebuild* is used. See EBUILD_GID.
ru: Группа, от имени которой запускается bash для обработки ебилдов при использовании метода кэширования ebuild или ebuild*. См. EBUILD_GID.

source: If EBUILD_USER is empty or nonexistent, use this user id. In this case and if ${EBUILD_UID} <= 0, the user id is not changed.
ru: Если переменная EBUILD_USER пуста или не существует, использовать этот id пользователя. В этом случае b если ${EBUILD_UID} <= 0, id пользователя не меняется.

source: If EBUILD_GROUP is empty or nonexistent, use this group id. In this case and if ${EBUILD_GID} <= 0, the group id is not changed.
ru: Если переменная EBUILD_GROUP пуста или не существует, использовать этот id группы. В этом случае, если ${EBUILD_GID} <= 0, id группы не меняется.

source: This variable is passed unchanged to ebuild.sh Usually ebuild.sh uses it to calculate the PATH.
ru: Эта переменная вызывается в неизменном виде из ebuild.sh Как правило, ebuild.sh обращается к ней, чтобы определить PATH.

source: This value is used as exit status if there are 0 matches. The value of COUNT_ONLY_PRINTED is honoured.
ru: Это значение используется как статус выхода, если имеется 0 совпадений. Значение переменной COUNT_ONLY_PRINTED соблюдается.

source: This value is used as exit status if there are 2 or more matches. The value of COUNT_ONLY_PRINTED is honoured.
ru: Это значение используется как статус выхода, если имеется 2 и более совпадений. Значение переменной COUNT_ONLY_PRINTED соблюдается.

source: Whether --quick is on by default.
ru: Указывает, используется ли опция --quick по умолчанию.

source: Whether --care is on.
ru: Указывает, используется ли опция --care по умолчанию.

source: If true, use build time from BUILD_TIME entry instead of reading the install time from the directory timestamp. This is usually preferable but slower. The BUILD_TIME exists only for packages emerged with >=portage-2.2_rc63
ru: Если значение равно truе, будет использовано время сборки из записи BUILD_TIME вместо считывания данных об установке из отметки времени каталога. Как правило, это предпочтительнее, но требует больше времени. BUILD_TIME существует только для пакетов, собранных portage не ниже версии 2.2_rc63

source: Whether --quiet is on by default.
ru: Указывает, используется ли опция --quiet по умолчанию.

source: Whether a newline is added magically at the end of a package.
ru: Указывает, добавляется ли новая строка автоматически в конец пакета.

source: If true, eix-diff will only consider version changes for installed packages.
ru: Если значение равно true, eix-diff будет искать только изменения версий установленных пакетов.

source: If true, eix-diff will not consider slots for version changes.
ru: Если значение равно true, eix-diff не будет искать изменения версий в слотах.

source: If false, eix-diff will mix deleted and changed packages
ru: Если значение равно false, eix-diff не будет различать удаленные и измененные пакеты.

source: Should eix-diff print a header info line?
ru: Должен ли eix-diff выводить информацию в заголовке?

source: This variable is only used for delayed substitution. If false, RESTRICT and PROPERTIES values are output.
ru: Эта переменная используется только для отложенной подстановки. Если ее значение равно false, будут выведены значения RESTRICT и PROPERTIES.

source: This variable is only used for delayed substitution. If false, tags are output for packages/versions with *.tbz2 files.
ru: Эта переменная используется только для отложенной подстановки. Если ее значение равно false, будет выведены метки пакетов/версий, содержащих *.tbz2-архив.

source: If true, calculate RESTRICT/PROPERTIES for installed versions.
ru: Если значение равно true, будут определены RESTRICT/PROPERTIES для установленных версий.

source: If true, read RESTRICT for installed versions always from disk. This is ignored if RESTRICT_INSTALLED=false.
ru: Если значение равно true, с диска всегда будет считываться RESTRICT для установленных версий. Если RESTRICT_INSTALLED=false, этого не произойдет.

source: This string is appended to the output of --print. To read variables in a shell without omitting trailing spaces, use e.g. VAR="`PRINT_APPEND=x eix --print VAR`" ; VAR="${VAR%x}"
ru: Эта строка добавляется к выводу --print. Чтобы оболочка, считывая переменные, не опускала пробелы в конце текстовой строки, используйте, например VAR="`PRINT_APPEND=x eix --print VAR`" ; VAR="${VAR%x}"

source: Defines whether --compact or --verbose is on by default.
ru: Определяет, какая опция используется по умолчанию, --compact или --verbose.

source: This variable is only used for delayed substitution. It defines whether all information lines are printed (even if empty).
ru: Эта переменная используется только для отложенной подстановки. Она определяет, будут ли выводится все информационные строки (даже пустые).

source: This variable is only used for delayed substitution. It defines whether a bug reference is printed in verbose format.
ru: Эта переменная используется только для отложенной подстановки. Она определяет, будет ли ссылка на ошибку выведена в подробном формате.

source: This variable is only used for delayed substitution. It defines whether eix-diff will output installed versions.
ru: Эта переменная используется только для отложенной подстановки. Она определяет, выводит ли eix-diff установленные версии.

source: This variable is only used for delayed substitution. It defines the color used for the name of packages.
ru: Эта переменная используется только для отложенной подстановки. Она определяет цвет для вывода имен пакетов

source: This variable is only used for delayed substitution. It defines the color used for the name of world packages.
ru: Эта переменная используется только для отложенной подстановки. Она определяет цвет для вывода имен world-пакетов.

source: This variable is only used for delayed substitution. It defines the color used for the name of packages providing a world package but which are not a world package.
ru: Эта переменная используется только для отложенной подстановки. Она определяет цвет для вывода имен пакетов, которые являются источником world-пакетов, но сами не принадлежат world.

source: This variable is only used for delayed substitution. It defines the color used for the name of world sets packages.
ru: Эта переменная используется только для отложенной подстановки. Она определяет цвет для вывода имен пакетов, которые принадлежат world-сетам.

source: This variable is only used for delayed substitution. It defines the color used for the name of packages providing a world sets package but which are not part of world sets.
ru: Эта переменная используется только для отложенной подстановки. Она определяет цвет для вывода имен пакетов, которые являются источником пакетов из world-сетов, но сами не принадлежат world-сетам.

source: This variable is only used for delayed substitution. It defines the color used for the category of packages.
ru: Эта переменная используется только для отложенной подстановки. Она определяет цвет для вывода категорий пакетов.

source: This variable is only used for delayed substitution. It defines the color used for the category of system packages.
ru: Эта переменная используется только для отложенной подстановки. Она определяет цвет для вывода категории system-пакетов.

source: This variable is only used for delayed substitution. It defines the color used for the category of packages which provide system packages but are not part of system.
ru: Эта переменная используется только для отложенной подстановки. Она определяет цвет для вывода категории пакетов, которые являются источником system-пакетов, но сами не принадлежат system.

source: This variable is only used for delayed substitution. It defines the color used for the category of world packages.
ru: Эта переменная используется только для отложенной подстановки. Она определяет цвет для вывода категории world-пакетов.

source: This variable is only used for delayed substitution. It defines the color used for the category name of packages providing a world package but which are not a world package.
ru: Эта переменная используется только для отложенной подстановки. Она определяет цвет для вывода категории пакетов, которые являются источником world-пакета, но не сами не являются world-пакетом.

source: This variable is only used for delayed substitution. It defines the color used for printing the category of world sets packages.
ru: Эта переменная используется только для отложенной подстановки. Она определяет цвет для вывода категории пакетов, принадлежащих world-сетам.

source: This variable is only used for delayed substitution. It defines the color used for the category name of packages a world sets package but which are not part of world sets.
ru: Эта переменная используется только для отложенной подстановки. Она определяет цвет для вывода категории пакетов, которые являются источником пакета из world-сетов, но сами не принадлежат world-сетам.

source: This variable is only used for delayed substitution. It defines the color used for printing upgrade recommendation texts.
ru: Эта переменная используется только для отложенной подстановки. Она определяет цвет для вывода рекомендованных обновлений.

source: This variable is only used for delayed substitution. It defines the color used for printing downgrade recommendation texts.
ru: Эта переменная используется только для отложенной подстановки. Она определяет цвет для вывода рекомендованных откатов.

source: This variable is only used for delayed substitution. It defines the color used for printing upgrade recommendation tags.
ru: Эта переменная используется только для отложенной подстановки. Она определяет цвет для вывода меток рекомендованных обновлений.

source: This variable is only used for delayed substitution. It defines the color used for printing downgrade recommendation tags.
ru: Эта переменная используется только для отложенной подстановки. Она определяет цвет для вывода меток рекомендованных откатов.

source: This variable is only used for delayed substitution. It defines the color used for printing tags for uninstalled packages which have gained a stable version.
ru: Эта переменная используется только для отложенной подстановки. Она определяет цвет для вывода меток удаленных пакетов, которые теперь имеют стабильную версию.

source: This variable is only used for delayed substitution. It defines the color used for printing tags for installed packages which have gained a stable version.
ru: Эта переменная используется только для отложенной подстановки. Она определяет цвет для вывода меток установленных пакетов, которые теперь имеют стабильную версию.

source: This variable is only used for delayed substitution. It defines the color used for "better version" tags (eix-diff).
ru: Эта переменная используется только для отложенной подстановки. Она определяет цвет для вывода метки лучшей версии (eix-diff).

source: This variable is only used for delayed substitution. It defines the color used for "worse version" tags (eix-diff).
ru: Эта переменная используется только для отложенной подстановки. Она определяет цвет для вывода метки худшей версии (eix-diff).

source: This variable is only used for delayed substitution. It defines the color used for "new package" tags (eix-diff).
ru: Эта переменная используется только для отложенной подстановки. Она определяет цвет для вывода метки нового пакета (eix-diff).

source: This variable is only used for delayed substitution. It defines the color used for "new package" separators (eix-diff).
ru: Эта переменная используется только для отложенной подстановки. Она определяет цвет для вывода разделителей нового пакета (eix-diff).

source: This variable is only used for delayed substitution. It defines the color used for "deleted package" separators (eix-diff).
ru: Эта переменная используется только для отложенной подстановки. Она определяет цвет для вывода разделителей удаленного пакета (eix-diff).

source: This variable is only used for delayed substitution. It defines the color used for "changed package" separators (eix-diff).
ru: Эта переменная используется только для отложенной подстановки. Она определяет цвет для вывода разделителей измененного пакета (eix-diff).

source: This variable is only used for delayed substitution. It defines the color used for tagging installed packages.
ru: Эта переменная используется только для отложенной подстановки. Она определяет цвет, используемый, чтобы пометить установленные пакеты.

source: This variable is only used for delayed substitution. It defines the color used for tagging uninstalled packages.
ru: Эта переменная используется только для отложенной подстановки. Она определяет цвет, используемый, чтобы пометить удаленные пакеты.

source: This variable is only used for delayed substitution. It defines the color used for printing the date.
ru: Эта переменная используется только для отложенной подстановки. Она определяет цвет для вывода даты.
